[
    {
        "title": "Mirror",
        "url": "http://www.truonex.com/projects/2544",
        "content": "Mirror. Mirror amplifies and reflects human breath. When a person blows into the mouthpiece of the mirror, a proportionally amplified wind blows back at her.",
        "score": 0.352197893102407,
        "scaled_score": 0.352197893102407,
        "id": 4
    },
    {
        "title": "Myrmegraph",
        "url": "http://www.truonex.com/projects/2546",
        "content": "Myrmegraph. Click to download the Antograph iPhone/iPad application based on the original Myrmegraph code.Inspired by the emergent behavior of ants, Myrmegraph is a system for drawing with living beings. As you move the mouse over Myrmegraph’s screen, you release a stream of simulated ants and simulated pheromone: the chemicals ants use to communicate. These ants obey a simple set of rules to follow the pheromone gradients stored invisibly in the image. From moment to moment, ants can change their heading t",
        "score": 0.262954580007423,
        "scaled_score": 0.262954580007423,
        "id": 6
    },
    {
        "title": "Impression",
        "url": "http://www.truonex.com/projects/2541",
        "content": "Impression. From the Screen SeriesImpression preserves the silhouettes of the bodies that move across its surface. As a person move into a projected rectangle, the profile of his shadow displaces the screen horizontally, so that one side of his silhouette is formed in light along the opposite edge of the screen. The screen absorbs the forms of the bodies that push against it – like clay it holds an impression.After some time without any bodies within the projection, the screen’s edges slide back into their",
        "score": 0.554699163903662,
        "scaled_score": 0.554699163903662,
        "id": 9
    },
    {
        "title": "Shadow",
        "url": "http://www.truonex.com/projects/2548",
        "content": "Shadow. From the Screen SeriesShadow flips the relationship between audience and screen, making the audience active and the screen receptive. Shadow is at first just a rectangle of white light projected onto a screen. As viewers move in front of its projection, their bodies, as expected, cast shadows. After viewers move out of the projected beam’s path, however, the movements of their shadows are replayed over and over, gradually fading away and returning to the pure white projection. In this way, viewe",
        "score": 0.374799243146057,
        "scaled_score": 0.374799243146057,
        "id": 12
    },
    {
        "title": "PolyQuest",
        "url": "-",
        "content": "PolyQuest. Mobility in urban environments is often coupled with a quest for efficiencies such as a nearby parking spot, a ride to some destination, a date for dinner, a ticket to the theater, or any other kind of service that one might need while on the move. The idea is an ad hoc, mobile \"Craig's List.\" We demonstrate a system that provides an easy way to advertise services or goods offered or sought by means of mobile phones and ultra-mobile PCs, and we are concerned with issues of ensuring trust, security, and anonymity for all participants.",
        "score": 0.241919211004633,
        "scaled_score": 0.241919211004633,
        "id": 14
    },
    {
        "title": "Reflectance Acquisition Using Ultrafast Imaging",
        "url": "http://www.truonex.com/projects/1392",
        "content": "Reflectance Acquisition Using Ultrafast Imaging. We demonstrate a new technique that allows a camera to rapidly acquire reflectance properties of objects 'in the wild' from a single viewpoint, over relatively long distances and without encircling equipment. This project has a wide variety of applications in computer graphics including image relighting, material identification, and image editing.",
        "score": 0.331306100951075,
        "scaled_score": 0.331306100951075,
        "id": 34
    },
    {
        "title": "Affective-Cognitive Product Evaluation and Prediction of Customer Decisions",
        "url": "-",
        "content": "Affective-Cognitive Product Evaluation and Prediction of Customer Decisions. Companies would like more new products to be successful in the marketplace, but current evaluation methods such as focus groups do not accurately predict customer decisions. We are developing new technology-assisted methods to try to improve the customer-evaluation process and better predict customer decisions. The new methods involve multi-modal affective measures (such as facial expression and skin conductance) together with behavioral measures, anticipatory-motivational measures, and self-report cognitive measures. These measures are combined into a novel computational model, the form of which is motivated by findings in affective neuroscience and human behavior. The model is being trained and tested with customer product evaluations and marketplace outcomes from real product launches.",
        "score": 0.143091193932829,
        "scaled_score": 0.143091193932829,
        "id": 38
    },
    {
        "title": "Carpal Skin",
        "url": "-",
        "content": "Carpal Skin. Carpal Skin is a prototype for a protective glove to protect against Carpal Tunnel Syndrome, a medical condition in which the median nerve is compressed at the wrist, leading to numbness, muscle atrophy, and weakness in the hand. Night-time wrist splinting is the recommended treatment for most patients before going into carpal tunnel release surgery. Carpal Skin is a process by which to map the pain-profile of a particular patient—its intensity and duration—and to distribute hard and soft materials to fit the patient’s anatomical and physiological requirements, limiting movement in a customized fashion. The form-generation process is inspired by animal coating patterns in the control of stiffness variation.",
        "score": 0.167166185764952,
        "scaled_score": 0.167166185764952,
        "id": 69
    },
    {
        "title": "Eco Steps",
        "url": "http://www.truonex.com/projects/1779",
        "content": "Eco Steps. Eco Steps, as based on the brief for this module, is a concept video for a service which allows people to track their expenses as well as the impact on the environment based on their purchasing habits.",
        "score": 0.49705600738184,
        "scaled_score": 0.49705600738184,
        "id": 75
    },
    {
        "title": "distherbed",
        "url": "http://www.truonex.com/projects/1770",
        "content": "distherbed. distherbed communicates the relationship between two plant-friends who feel separation anxiety.",
        "score": 0.0133333333333351,
        "scaled_score": 0.0133333333333351,
        "id": 78
    },
    {
        "title": "Key Grip",
        "url": "http://acg.media.mit.edu/people/manor",
        "content": "Key Grip. It takes quite a few people to keep the visuals flowing for live broadcast or display: cameramen filming, technicians cutting and fading clips, and still others controlling the segue animations and copy. Lacking access to that kind of manpower or equipment, we have built a digital video camera with onboard controls that allows for live, real-time editing and special effects for immediate redisplay or broadcast. A wireless version is currently in development.",
        "score": 0.729158728866021,
        "scaled_score": 0.729158728866021,
        "id": 84
    },
    {
        "title": "Consumer Holo-Video",
        "url": "http://obm.media.mit.edu",
        "content": "Consumer Holo-Video. The goal of this project, building upon work begun by Stephen Benton and the Spatial Imaging group, is to create an inexpensive desktop monitor for a PC or game console that displays holographic video images in real time, suitable for entertainment, engineering, or medical imaging. To date, we have demonstrated the fast rendering of holo-video images (including stereographic images that unlike ordinary stereograms have focusing consistent with depth information) from OpenGL databases on off-the-shelf PC graphics cards; current research addresses new optoelectronic architectures to reduce the size and manufacturing cost of the display system.",
        "score": 0.0836368653892653,
        "scaled_score": 0.0836368653892653,
        "id": 91
    },
    {
        "title": "Holographic Laser Printer",
        "url": "-",
        "content": "Holographic Laser Printer. Full-color, wide-angle, and large-size computer-generated hard-copy holograms take considerable time to create. A \"holographic laser printer\" will allow hard-copy holograms to be generated in minutes instead of hours, automatically and without wet processing. Research topics include recording materials and processing, optical design, image processing and LCD display, and optical techniques for image noise reduction.",
        "score": 0.315939938522447,
        "scaled_score": 0.315939938522447,
        "id": 93
    },
    {
        "title": "Drag-and-Drop Interface for Registration-Free Object Delivery",
        "url": "http://www.truonex.com/projects/2391",
        "content": "Drag-and-Drop Interface for Registration-Free Object Delivery. We propose a simple drag-and-drop interface on a touch screen to give instructions to an object-delivery robot. The user uses a finger to drag a target object and drop it to a target location on the screen that shows an image of the floor provided by a ceiling camera. The system then autonomously executes a delivery task without continuous control by the user. We employ user-guided computer vision methods to identify and track an object in a scene without prior registration. We conducted a user",
        "score": 0.479087020063331,
        "scaled_score": 0.479087020063331,
        "id": 100
    },
    {
        "title": "isawyou",
        "url": "http://www.truonex.com/projects/1607",
        "content": "isawyou. The “I saw you” is a tradition in the US where a stranger posts a note to another stranger expressing attraction, admiration, desire, or curiosity.",
        "score": 0.0200000000002681,
        "scaled_score": 0.0200000000002681,
        "id": 105
    },
    {
        "title": "Piecewise Planar Stereo for Image-based Rendering",
        "url": "http://www.truonex.com/projects/2154",
        "content": "Piecewise Planar Stereo for Image-based Rendering. Abstract We present a novel multi-view stereo method designed for image-based rendering that generates piecewise planar depth maps from an unordered collection of photographs. First a discrete set of 3D plane candidates are computed based on a sparse point cloud of the scene (recovered by structure from motion) and sparse 3D line segments reconstructed from multiple views. Next, evidence is accumulated for each plane using 3D point and line incidence and photo-consistency cues. Finally, a piecew",
        "score": 0.24732398907575,
        "scaled_score": 0.24732398907575,
        "id": 114
    },
    {
        "title": "Socio-Kinetics",
        "url": "http://www.media.mit.edu/~hyun/research/motion/",
        "content": "Socio-Kinetics. Online public discussion spaces such as Usenet news groups are rich social environments. The social dynamics within the community are not obvious by looking at the strings of text-based content. Only a careful reading of the threads allows the viewer to discern complexities and nuances of social interactions. Expressive visualization, however, is an alternative medium for effectively conveying such information. In order to animate the dynamic social qualities found within the static data of a Usenet interface, motion is used as the communicative agent for this visual translation. The goal of the research is to isolate those elements that comprise visual motion, such as position, direction, speed, and time, in order to develop a visual language through which the social complexities of online communities can be communicated. A series of studies exploring this problem are being carried out using a theoretical framework inspired by cognitive and artistic precedents. We hope these investigations result in an understanding of how motion can be successfully employed as a visual language for social expression.",
        "score": 0.0482148157538982,
        "scaled_score": 0.0482148157538982,
        "id": 121
    },
    {
        "title": "Geometric image parsing in man-made environments",
        "url": "http://www.truonex.com/projects/1956",
        "content": "Geometric image parsing in man-made environments. We present a new optimization parsing framework for the geometric analysis of a single image coming from a man-made environment. This framework models the scene as a composition of geometric primitives spanning different layers from low level (edges) through mid-level (lines segments, lines and vanishing points) to high level (the zenith and the horizon). The inference in such a model thus jointly and simultaneously estimates a) the grouping of edges into the line segments, b) the grouping of li",
        "score": 0.780291463680343,
        "scaled_score": 0.780291463680343,
        "id": 125
    },
    {
        "title": "Photo Clip Art",
        "url": "http://www.truonex.com/projects/1955",
        "content": "Photo Clip Art. We present a system for inserting new objects into existing photographs by querying a vast image-based object library, precomputed using a publicly available Internet object database. The central goal is to shield the user from all of the arduous tasks typically involved in image compositing. The user is only asked to do two simple things: 1) pick a 3D location in the scene to place a new object; 2) select an object to insert using a hierarchical menu. We pose the problem of object insertion as",
        "score": 0.634376623189344,
        "scaled_score": 0.634376623189344,
        "id": 128
    },
    {
        "title": "SoundForms",
        "url": "http://www.truonex.com/projects/1951",
        "content": "SoundForms. Soundforms is a tangible interface for collaborative musical composition with everyday objects. The shapes and size of objects are used as simple icons for controlling sound output, affording a playful interface for people to experiment together in a short sound composition. Please watch the videos below for a demonstration of this playful tool! For a more detailed explanation of both applications please visit: http://www.perspectum.com/soundforms and click on the videos below.",
        "score": 0.191157520011921,
        "scaled_score": 0.191157520011921,
        "id": 132
    },
    {
        "title": "Affective Tangibles",
        "url": "-",
        "content": "Affective Tangibles. People naturally express frustration through the use of their motor skills. The purpose of the Affective Tangibles project is to develop physical objects that can be grasped, squeezed, thrown, or otherwise manipulated via a natural display of affect. Constructed tangibles include a PressureMouse, affective pinwheels that are mapped to skin conductance, and a voodoo doll that can be shaken to express frustration. We have found that people often increase the intensity of muscle movements when experiencing frustrating interactions.",
        "score": 0.720221250349685,
        "scaled_score": 0.720221250349685,
        "id": 134
    },
    {
        "title": "Mr. Java:  Customer Support",
        "url": "-",
        "content": "Mr. Java: Customer Support. Mr. Java is the Media Lab's wired coffee machine, which keeps track of usage patterns and user preferences. The focus of this project is to give Mr. Java a tangible customer-feedback system that collects data on user complaints or compliments. \"Thumbs-up\" and \"thumbs-down\" pressure sensors were built and their signals integrated with the state of the machine to gather data from customers regarding their ongoing experiences with the machine. Potentially, the data gathered can be used to learn how to improve the system. The system also portrays an affective, social interface to the user: helpful, polite, and attempting to be responsive to any problems reported.",
        "score": 0.198049407515778,
        "scaled_score": 0.198049407515778,
        "id": 141
    },
    {
        "title": "Online Emotion Recognition",
        "url": "http://www.media.mit.edu/affect/AC_research/projects/emotion_recognition.html",
        "content": "Online Emotion Recognition. This project is aimed at building a system to recognize emotional expression given four physiological signals. Data was gathered from a graduate student with acting experience as she intentionally tried to experience eight different emotional states daily over a period of several weeks. Several features are extracted from each of her physiological signals. The first classifiers gave a classification result of 88% success when discriminating among 3 emotions (pure chance would be 33.3%), and of 51% when discriminating among 8 emotions (pure chance 12.5%). New, improved classifiers reach an 81% success rate when discriminating among all 8 emotions. Furthermore, an online classifier has now been built using the old method, which gives a success rate only 8% less than its old offline counterpart (i.e. 43%). We expect this percentage to sharply increase when the new methods are adapted to run online.",
        "score": 0.397889378860741,
        "scaled_score": 0.397889378860741,
        "id": 142
    },
    {
        "title": "Economic Models for Cooperative Media Distribution",
        "url": "-",
        "content": "Economic Models for Cooperative Media Distribution. Cooperative media distribution provides a solution to the scalability and efficiency problem of real-time media distribution and information dissemination in general. The flip-side of this is that collaborative media distribution is a destabilizing issue for entities that rely on a centralized architecture for revenue. In order to reconcile the economic realities of media distribution with the technical necessity of network scalability, a suitable economic model is required. We are developing licensing and payment schemes to enable and encourage cooperative distribution, while providing viable revenue schemes for intellectual property holders.",
        "score": 0.77320303936345,
        "scaled_score": 0.77320303936345,
        "id": 153
    },
    {
        "title": "Cooperative Transport Protocols",
        "url": "-",
        "content": "Cooperative Transport Protocols. Cooperative communication represents a paradigm shift from current point-to-point, client-server interaction to a fully decentralized, symmetric model of communication. In order to realize the gains of this model of communication, a new class of protocols is required. In this project, we design protocols and architectures for multipoint-to-multipoint communication, ranging from media distribution to real-time communication.",
        "score": 0.190179119969651,
        "scaled_score": 0.190179119969651,
        "id": 154
    },
    {
        "title": "Self-Powered / Wireless Push Button Controller",
        "url": "-",
        "content": "Self-Powered / Wireless Push Button Controller. We have built a compact piezoelectric push button and associated minimal circuitry that is able to transmit a digital RFID code to the immediate region (50-100 foot radius) upon a single button push, without the need of batteries or other energy sources. Such devices have the potential of enabling the introduction of controls and interfaces into interactive environments without requiring any wiring, optical/acoustic lines of sight, or batteries.",
        "score": 0.217894586799409,
        "scaled_score": 0.217894586799409,
        "id": 159
    },
    {
        "title": "AnthroViz",
        "url": "http://smg.media.mit.edu/~ethanlp/research/AV_overview.htm",
        "content": "AnthroViz. Anthropomorphic visualization is a new approach to presenting historical information about participants in online spaces using the human form as the basis for the visualization. We use several pieces of data from the messages an author writes in a Usenet newsgroup to create a depiction that looks somewhat like a person. We are currently investigating users' understanding and reactions to the visualization to assess the advantages and disadvantages of this visual approach.",
        "score": 0.959999999993053,
        "scaled_score": 0.959999999993053,
        "id": 161
    },
    {
        "title": "Perifoveal Display",
        "url": "-",
        "content": "Perifoveal Display. Today's GUIs are made for small screens with little information shown. Real-time data that goes beyond one small screen needs to be continuously scanned with our eyes in order to create an abstract model of it in one's mind. GUIs therefore do not work with huge amounts of data. The Perifoveal Display takes this abstraction from the user and visualizes it in a way that the full range of vision can be used for data monitoring. This can be realized by taking care of the different visual systems in our eye. Our vision has a field of view from about 120°, which is highly sensitive for motion. 6° of our vision is very slow but complex enough to read text.",
        "score": 0.052640625975645,
        "scaled_score": 0.052640625975645,
        "id": 172
    },
    {
        "title": "Measurement of Violin Bowing Technique",
        "url": "http://media.mit.edu/~young",
        "content": "Measurement of Violin Bowing Technique. There have been few studies of bowing data from real players, in part due to the difficulty in capturing this information. We have designed an interface to measure bowing parameters produced by real players, while maintaining the portability and playability of a traditional violin bow. This interface, the Hyperbow, consists of a carbon-fiber violin bow with a custom wireless sensing system (with accelerometers, gyroscopes, electric field position and force sensors). The Hyperbow is partnered with a Yamaha Silent Violin SV-200 also augmented with gesture sensors. This playable measurement system is the core component of an experimental setup used to investigate the bowing parameters produced by real violinists. In these investigations, the parameters are recorded with the sound produced during performances of different bowing techniques (détaché, martelé, spiccato). These data can then be analyzed to help understand the various strategies employed by violinists to achieve similar goals in sound production.",
        "score": 0.0669543472333417,
        "scaled_score": 0.0669543472333417,
        "id": 198
    },
    {
        "title": "TOUCH ME NOT",
        "url": "http://www.truonex.com/projects/2705",
        "content": "TOUCH ME NOT. Hand Gesture Recognition a highly anticipated technology of this century ,has different face towards our environment.We developed gesture interface device which eliminates the use mouse and the keyboard from our traditional computers . In this system a webcam is used to track the objects and a computer vision algorithm is used to control the devices based on the webcam input.It can be stretched to any of our daily applications,such as Television,Gaming..etc The traditional user interfaces relies much on the mouse and keyboard. But it is difficult to use these devices continuously. The aim is to develop a gesture based interface, where the system uses inbuilt webcam to track the hand movement and controls the mouse pointer accordingly. The first step towards this is the development of object tracking mechanism. Though there several object tracking algorithms are readily available, CAMSHIFT algorithm provides more accuracy when compared to MEAN SHIFT and others. The other option is the use of HAAR classifiers but involves a tedious process of training and also we cannot extend it to different objects. So we modified the OpenCv CAMSHIFT algorithm to track our objects. The Second Step is to distinguish the object color from our skin color, so we added a red ribbon to the hands such it not only provides a clear view but also gives an option for different gestures. Finally the algorithm tracks the hand using the input from the webcam and the co-ordinates are extracted from the tracked object for every frame and passed to windows m functions. Thus whenever the object is moved via webcam, the cursor also moves accordingly. Different gestures are used to produce click functions and other operations.",
        "score": 0.148434495325056,
        "scaled_score": 0.148434495325056,
        "id": 229
    },
    {
        "title": "8D Display",
        "url": "-",
        "content": "8D Display. The 8D Display combines a glasses-free 3D display (4D light field output) with a relightable display (4D light field input). The ultimate effect of this extension to our earlier BiDi Screen project will be a display capable of showing physically realistic objects that respond to scene lighting as we would expect. Imagine a shiny virtual teapot in which you see your own reflection, a 3D model that can be lighted with a real flashlight to expose small surface features, or a virtual flashlight that illuminates real objects in front of the display. As the 8D Display captures light field input, gestural interaction as seen in the BiDi Screen project is also possible.",
        "score": 0.146728047250136,
        "scaled_score": 0.146728047250136,
        "id": 238
    },
    {
        "title": "FlickInk",
        "url": "-",
        "content": "FlickInk. Have you ever been in a teleconference and found it difficult to deliver what you’ve been writing/sketching on paper to the remote participant? FlickInk reinvents paper/pen-based interaction and enables your notes to jump from paper to physical surroundings as well as to a remote destination. With a quick flick of the pen, it allows you to naturally “throw” your handwriting to remote collaborators whenever you're ready. While the contents are sharable in real time as you write, you maintain control of what's shared and what's private. Control over authorship and privacy is enhanced as this paper-based media comes accessible and natural in remote collaboration. Not only in the context of collaboration, FlickInk also seamlessly transfers writings/sketches on paper to specified physical objects. We aim to enhance this novel interaction to enrich highly personalized dynamic experiences for living-working space in the future.",
        "score": 0.157680749688854,
        "scaled_score": 0.157680749688854,
        "id": 240
    },
    {
        "title": "Watch Me Move!",
        "url": "-",
        "content": "Watch Me Move!. Microsoft Kinect has popularized the use of body gestures to control games and animations, but only expert programmers can create applications for the Kinect. With our new video-motion extensions to Scratch, it is possible for everyone, even novice programmers, to create Kinect-like games and animations using only a standard webcam. Our extension uses computer-vision algorithms based on optical flow to track motion from real-time video, allowing Scratch programmers to access the amount and direction of motion across the whole scene and also under individual objects.",
        "score": 0.816925328758229,
        "scaled_score": 0.816925328758229,
        "id": 247
    },
    {
        "title": "PostBrainstorm: An interactive wall for design brainstorming",
        "url": "http://www.truonex.com/projects/2013",
        "content": "PostBrainstorm: An interactive wall for design brainstorming. PostBrainstorm integrates several new interaction techniques into a visual brainstorming tool for direct pen-based interaction on the Interactive Mural, a large (6’x3.5’) high resolution (64 dpi) display. Its “interactive wall” metaphor for interaction has been guided by several goals: to support both freehand sketching and high-resolution materials, such as images, 3D models and GUI application windows; to present a visual appearance that does not clutter the content with control devices; and t",
        "score": 0.286179814746239,
        "scaled_score": 0.286179814746239,
        "id": 266
    },
    {
        "title": "Rachis exploraparum",
        "url": "http://www.truonex.com/projects/1763",
        "content": "Rachis exploraparum. Rachis exploraparum is an exploration of the properties of paper and fiber against the human figure.",
        "score": 0.0100000000000952,
        "scaled_score": 0.0100000000000952,
        "id": 273
    },
    {
        "title": "Rehab Sound Sculptor",
        "url": "-",
        "content": "Rehab Sound Sculptor. The Rehab Sound Sculptor is a motion-tracking interface that allows the researcher to quickly map a subject's movement to any aspect of sound control. The motivation for developing this interface is that it allows us to determine which attributes of sound are potentially more useful than others for providing feedback in motor rehabilitation. There has been a significant body of work, particularly with Parkinson's disease, that has shown the rehabilitative benefit of auditory feedback during physical therapy. However, little work has been done to determine exactly which features of sound are responsible for this benefit. With the Rehab Sound Sculptor interface, we can investigate the relative contributions of specific sound attributes to rehabilitation.",
        "score": 0.649600393642067,
        "scaled_score": 0.649600393642067,
        "id": 325
    },
    {
        "title": "ThoughtSort",
        "url": "http://thoughtsort.robhemsley.co.uk",
        "content": "ThoughtSort. Search engines often return millions of results to a query. Organizing these results is a challenge, particularly for visual imagery. Search engines typically use textual annotations rather than the visual characteristics of the images to perform the search. ThoughtSort uses gaze detection and inferred points of interest to dynamically adjust the results of a search query. The user implicitly steers the system by showing more visual interest in some results than others. With ThoughtSort, search becomes a more dynamic experience as results self-adjust before the user's eyes. This application is part of a framework which aims to provide developers with the necessary tools to create dynamic and considerate content that can adjust to the natural responses of the user.",
        "score": 0.160476386688489,
        "scaled_score": 0.160476386688489,
        "id": 337
    },
    {
        "title": "Climate Central: Fires",
        "url": "http://www.truonex.com/projects/1894",
        "content": "Climate Central: Fires. Climate Central released a Wildfires 2011 package in anticipation of the coming fire season. DuKode contributed several pieces, including data visualizations of high fire years in Montana and Nevada, and an infographic that contrasts these ecosystems.",
        "score": 0.426767753839196,
        "scaled_score": 0.426767753839196,
        "id": 2564
    },
    {
        "title": "Speakeasy",
        "url": "http://www.3-way.org",
        "content": "Speakeasy. Speakeasy is a community-based telephone service that connects multilingual volunteers, non-English speaking immigrants, and social service agencies.",
        "score": 0.0100000000001301,
        "scaled_score": 0.0100000000001301,
        "id": 359
    },
    {
        "title": "Metal airplanes",
        "url": "http://www.truonex.com/projects/2078",
        "content": "Metal airplanes. Metal airplanes \"Paper airplanes\" in metal from scrap metal in the metal workshop. They where done pretty quick (20 minutes or so per plane) and painted with leftover paint at the paint booth.",
        "score": 0.0133333333333446,
        "scaled_score": 0.0133333333333446,
        "id": 384
    },
    {
        "title": "Discreet Window",
        "url": "http://www.truonex.com/projects/1575",
        "content": "Discreet Window. The Discreet Window is a blind that provides visual feedback for a person’s work activity in a home-office environment.",
        "score": 0.862857142451665,
        "scaled_score": 0.862857142451665,
        "id": 390
    },
    {
        "title": "We Are Voice",
        "url": "http://www.truonex.com/projects/1572",
        "content": "We Are Voice. Concept Imagine being able to gather thousands of consumers together to put direct pressure on businesses worldwide – to meet our needs, to behave responsibly or simply to give us a better deal. Imagine as a business having direct access to thousands of consumers – without having to invest in a costly backend to do it.",
        "score": 0.250933275813627,
        "scaled_score": 0.250933275813627,
        "id": 395
    },
    {
        "title": "grassroots mapping",
        "url": "-",
        "content": "grassroots mapping. With the Marketing and the Placebo Effect project, we are investigating how various economic, cultural, and social factors such as pricing, branding, or stigma could affect how people will experience their medications.",
        "score": 0.103563147280718,
        "scaled_score": 0.103563147280718,
        "id": 397
    },
    {
        "title": "Trillion Frames Per Second Camera",
        "url": "http://www.truonex.com/projects/1377",
        "content": "Trillion Frames Per Second Camera. We have developed a camera system that captures movies at an effective rate of approximately one trillion frames per second. In one frame of our movie, light moves only about 0.6 mm. We can observe pulses of light as they propagate through a scene. We use this information to understand how light propagation affects image formation and to learn things about a scene that are invisible to a regular camera.",
        "score": 0.298740594978201,
        "scaled_score": 0.298740594978201,
        "id": 401
    },
    {
        "title": "Coded Computational Photography",
        "url": "http://www.truonex.com/projects/1371",
        "content": "Coded Computational Photography. Computational photography is an emerging multi-disciplinary field that is at the intersection of optics, signal processing, computer graphics and vision, electronics, art, and online sharing in social networks. The first phase of computational photography was about building a super-camera that has enhanced performance in terms of the traditional parameters, such as dynamic range, field of view, or depth of field. We call this 'Epsilon Photography.' The next phase of computational photograp",
        "score": 0.277873920625188,
        "scaled_score": 0.277873920625188,
        "id": 407
    },
    {
        "title": "Personal Video Layers for Privacy",
        "url": "-",
        "content": "Personal Video Layers for Privacy. We are developing an opt-in camera network, in which users carrying wearable tags are visible to the network and everyone else is invisible. Existing systems for configurable dynamic privacy in this context are opt-out and catch-all; users desiring privacy carry pre-registered tags that disable sensing and networked media services for everyone in the room. To address these issues, we separate video into layers of flexible sprites representing each person in the field of view, and transmit video of only those who opt-in. Our system can also define groups of users who can be dialed in and out of the video stream dynamically. For cross-reality applications, these dynamic layers achieve a new level of video granularity, allowing users and groups to uncover correspondences between their activities across spaces.",
        "score": 0.287953089751953,
        "scaled_score": 0.287953089751953,
        "id": 410
    },
    {
        "title": "Full Resolution Lightfields using Heterodyne Camera",
        "url": "-",
        "content": "Full Resolution Lightfields using Heterodyne Camera. Light field camera have inherent trade offs between spatial and angular resolution. We mathematically model the image capture in light field cameras in spatial domain and prove that full resolution light field capture is possible using the heterodyne camera. We demonstrate refocusing a d full resolution imaging results using heterodyne light field camera.",
        "score": 0.163869537960251,
        "scaled_score": 0.163869537960251,
        "id": 413
    },
    {
        "title": "Swerve / Crab Drive Steering Mechanism",
        "url": "http://www.truonex.com/projects/2715",
        "content": "Swerve / Crab Drive Steering Mechanism. A steering system which allows for the most flexible configurations of wheels and movements. It allows each wheel to be independently controlled both in power and direction (a full 360 degrees). This configuration and control mechanism allows for virtually any possible movement which can be made by a wheeled vehicle. While more complicated compared to most other control mechanisms it is the least restrictive and could be employed in specialized robots where operational requirements change. Many of the standard wheeled drive configurations that are used in vehicles and robotics are chosen because of their simplicity to build, control, and suitability to a specific task (kinds of mobility / maneuverability required). This generally works well except each of these common configurations typically exclude maneuvers that another form might have, thus having the designers to make a limiting choice (what can they live without). This was the motivating thought, can we design a steering system that is reasonably reliably, cost effective, replaceable, and most important uncompromising in functionality. Essential this would be an extension of synchronous steering, with the main difference being that in a synchronous configuration all wheels are able to rotate orientation to 90 degrees as long as all the wheels are rotated to the same angle. In our configuration we stipulate that each wheel can rotate its orientation a full 360 degrees and drive power independently of one another. Review of many different drive mechanisms to see what each specifically offered, how they were different, the complexity in building the mechanism, the electronic control of the mechanics, and how to interface with the controls. We looked at differential, skid, ackermann, synchronous, omni, articulated, and independent. <p>The list of parts included in this design is: <br /> <ul> <li>Drive Motors: CIMS - 1 per wheel - there are (4) wheels</li> <li>Wheels: 4 in AndyMark Plaction wheels (am-0198)</li> <li>Gear Reduction: 8.30:1 in 2 stages (56:18 by HTD5 synchronous belt & pulleys; 24:9 by #35 chain & sprockets)</li> <li>Steering Motors: BaneBots M3-RS395-12 - 1 per wheel</li> <li>Steering Reduction: BaneBots 3-stage 132:1 planetary gearbox; transmitted 1:1 via HTD5 synchronous belt with 32T pulleys</li> </ul> </p> This design was further modified to make it more cost effective to implement this in an actual robot, and make each wheel component self contained within a cube that can be easily swapped out when problems arose. We also learned that in the actual implementation the sway / lateral movement of the wheel mechanism when under stress was not stable so we needed a way to stabilize the lateral movement. The implementation proved to be a very cost effective and agile first iteration of the concept. More improvements can be made on how the lateral force of the drive mechanism is handled and replacing nylon buffers with bearings for a stronger and smoother operation. This configuration was able to replicate all the common modes of operation while allowing non-standard ways of movement. We decided to go with three wheels instead of 4 to save on weight in the overall design. However controlling this type of locomotion is not trivial, both in the logic implementation and physical control. Better input devices are required besides the dual joystick configuration we used. Encoders were used to track the wheel position as well as speed of rotation paired with a 2-axis accelerometer and gyroscope. These sensors were needed to auto correct for drift and orientation since forward is the way the wheels are pointed (NOT the front of the robot). This notion means the controls translate in real-time relative to the direction of travel, and it was this configuration operators were able to most easily able to control the robot.",
        "score": 0.0578531101962044,
        "scaled_score": 0.0578531101962044,
        "id": 416
    },
    {
        "title": "Multi-agent Simulation for Task Selection on Collaborating Communities",
        "url": "http://www.truonex.com/projects/2717",
        "content": "Multi-agent Simulation for Task Selection on Collaborating Communities. Analysis of a multi-agent system intended to model total task completion rates in collaborating communities. The spillover effect is emergent. We begin to quantify externality of marginal utilities. We are concerned with maximizing the output of the given community through regulation of agent to task ratios. We outline emergent externalities when collaboration occurs, even in absence of communication and planning. Our recent work has shown that as the collaboration among agents increases, the performance of the agent community increases linearly and the optimal performance of the agent community is achieved when the collaboration among agents is 100%. Furthermore, when the number of tasks assigned is far fewer than the number of agents in the community, the optimal performance of the agent community is achieved at nearly 100% collaboration rate. We have developed a series of multiagent simulations for a domain neutral environment where agents performed abstract tasks. The task selection process has three variants based on how the agents collaborate; min-collaboration, random-collaboration, maxcollaboration. The min-collaboration and maxcollaboration are greedy algorithms because the try to maximize or minimize distribution of agents among tasks respectively. Often situations arrise where communities exist and individuales have to \"cooperate\" in order to complete taks, however in some of these situations there might not be a centralized command to direct people or a means of identifying which individuals are more suited to specific tasks better than others. This raises the question of how to form collaboration groups in this environment which will be reasonable effective and have the minimization of wasting resources, or maximizing community output. It is apparent that given the marginal utility that agents on the upper ends of collaboration levels would achieve a better perform- ance for the community as a whole if they were re- distributed to other tasks. This illustrates that the major controlling attribute is ultimately the distribu- tion of agents among the tasks or in this case the task selection algorithm. The safe task selection al- gorithm out of the three that were tried was the ran- dom-collaboration-task-selection. Meaning that if you have no means of regulating collaboration ran- dom always produces more output than no cooperation. However, if you have mechanisms for regulat- ing groups, even as simply as regulating the percentage out of the community involved. Then it is best to maximize the group to around 70% collaboration levels to maximize the output of the community (Figure 5). <br /><br /> It is also apparent that by regulating how the tasks are selected you can control the externalities in the system, if this is a concern to you or if you need to evaluate the benefit to the sys- tem as a whole. You also cannot just simply look at output when determining efficiency of a community when collaboration occurs, because as shown much waste and spillover can occur when there is interdependence among agents.",
        "score": 0.0603476221992167,
        "scaled_score": 0.0603476221992167,
        "id": 417
    },
    {
        "title": "1910-2010 in Korea",
        "url": "http://www.truonex.com/projects/1593",
        "content": "1910-2010 in Korea. This project illustrates the relationship between Korea and its neighboring countries from 1910 to 2010.",
        "score": 0.0133333333333484,
        "scaled_score": 0.0133333333333484,
        "id": 459
    },
    {
        "title": "Agents for Collaborative Browsing",
        "url": "http://lieber.www.media.mit.edu/people/lieber/Lieberary/Lets-Browse/Lets-Browse-Intro.html",
        "content": "Agents for Collaborative Browsing. What would it mean to browse collaboratively? In business meetings or family situations, several people may be attending a browsing session, even if only one \"controls\" the browser. The success of browsing depends on satisfying the interests of the passive participants as well. We are working on an agent that will provide assistance to group browsing, representing the interests of the entire group, and performing \"reconnaissance\" in anticipation of what pages are likely to be of common interest. It features automatic detection of the presence of users, acquisition of information about the interests of users, automated \"channel surfing,\" and dynamic display of the user profiles and explanation of recommendations.",
        "score": 0.160997838325551,
        "scaled_score": 0.160997838325551,
        "id": 464
    },
    {
        "title": "Agent-Application Communication",
        "url": "http://lieber.www.media.mit.edu/people/lieber/Lieberary/Integrating-UI-Agents/Integrating-Agents-Intro.html",
        "content": "Agent-Application Communication. Current experiments in agent software rely mostly on domain-specific applications that either have been programmed from scratch, or explicitly modified with an agent in mind. Is it possible to make a tool kit or protocol that would allow an agent to communicate and to control applications that have been constructed more conventionally? Can the agent \"take the place\" of the user in the interface? Can the agent have access to the application's data and behavior? Will commercial \"inter-application communication\" mechanisms suffice? What is the division of labor between the agent and the application? This work will explore these questions.",
        "score": 0.10319186495799,
        "scaled_score": 0.10319186495799,
        "id": 470
    },
    {
        "title": "Disruptive Interruptions",
        "url": "-",
        "content": "Disruptive Interruptions. Disruption is an important issue in the design of self-adaptive interfaces. This project attempts to make a computer intelligent enough to select the appropriate sensorial modality. This project investigates which modality is the most efficient and at the same time, the least disruptive. Two interruption modalities are studied: heat and light. This research adds to previous research by showing that there is an effect on performance caused by interruption modalities: for example, thermal modality produced a larger decrease in performance than visual modality; this modality has a greater disruptive effect on interrupted tasks than light. Disruptiveness and performance measures agree that heat causes more of a detrimental effect than light when used as an interruption.",
        "score": 0.196543831267152,
        "scaled_score": 0.196543831267152,
        "id": 473
    },
    {
        "title": "Living Frames",
        "url": "http://www.truonex.com/projects/1627",
        "content": "Living Frames. Intel Labs asked us to look 10 years into the future and imagine how people might capture or display photos given expected advances in technology. Intel is in the ever faster processor business and uses these predictions to steer chip architecture as well as to help spur developers imagination to maintain demand for faster silicon.",
        "score": 0.169473416455607,
        "scaled_score": 0.169473416455607,
        "id": 481
    },
    {
        "title": "Visualizing the text of (children's) book series",
        "url": "http://www.truonex.com/projects/2133",
        "content": "Visualizing the text of (children's) book series. A stream of dancing lights, for all the world like the shimmering curtains of the aurora, blazed across the screen. They took up patterns that were held for a moment only to break apart and form again, in different shapes, or different colours; they looped and swayed, they sprayed apart, they burst into showers of radiance that suddenly swerved this way or that like a flock of birds changing direction in the sky. And as Lyra watched, she felt the same sense, as of trembling on the brink of under",
        "score": 0.23769080104336,
        "scaled_score": 0.23769080104336,
        "id": 484
    },
    {
        "title": "Audio Spotlight",
        "url": "http://sound.media.mit.edu/archives.html#as",
        "content": "Audio Spotlight. Standard loudspeakers transmit sound which necessarily spreads very quickly, and the control of sound projection and position is only about as flexible as where you can hang a loudspeaker. The Audio Spotlight is a device that will project sound much like a spotlight projects light: shining it at a listener allows only that person to hear it, while shining it at a surface causes the sound to appear to originate from there, creating something of a \"virtual loudspeaker.\" Beamsteering will allow the sound to move, enabling the user dynamically to place sound—exactly, and only, where it is desired.",
        "score": 0.697658623047663,
        "scaled_score": 0.697658623047663,
        "id": 493
    },
    {
        "title": "Topobo Backpacks",
        "url": "http://web.media.mit.edu/~hayes/topobo/",
        "content": "Topobo Backpacks. This project provides new ways to work with Topobo motion sequences. The Backpacks are a series of physical components with a knob that can be attached to a Topobo Active. The Backpacks will modify the way your recorded motion plays back. For instance, by turning the knob on the Bigger/Smaller (Amplitude) Backpack, you can make the motion larger or smaller. Other Backpacks include \"Time Delay,\" \"Faster-Slower,\" and \"Position Offset.\" The Position Offset Backpack has light sensors instead of a knob, allowing users to build creatures that can walk towards or away from light. The Backpacks introduce ideas about symbolic representation and feedback to Topobo.",
        "score": 0.351180240070599,
        "scaled_score": 0.351180240070599,
        "id": 506
    },
    {
        "title": "xLink: Extensible Context Management Layer",
        "url": "http://interact.media.mit.edu/",
        "content": "xLink: Extensible Context Management Layer. The Context Manager is a generalized framework for connecting a variety of pervasive sensor technologies and output modalities to intelligent context-aware services. It focuses on binding together technologies that can be used to sense activity and interaction to services in a device- and collocation-agnostic way, and then use the context information, along with other personalization data that may be part of the user’s profile, to provide highly relevant, “just-in-time— information and recommendations. The output is produced in a generalized form that can then be “rendered— into different modalities, such as WAP (cell phone output), audio, or a regular computer screen. The Context Manger can also “push— highly relevant information to the user, consolidating the point-of-contact between a multitude of services and the user in a consistent, manageable way. This infrastructure will be part of several projects, including ReachMedia, Invisible Media, and the UbER-Badge Personalization Project.",
        "score": 0.317173923231523,
        "scaled_score": 0.317173923231523,
        "id": 509
    },
    {
        "title": "PingPongPlus",
        "url": "http://www.truonex.com/projects/2227",
        "content": "PingPongPlus. PingPongPlus is a digitally enhanced version of the classic ping-pong game. It is played with ordinary, un-tethered paddles and balls, and features a “reactive table” that incorporates sensing, sound, and projection technologies. Projectors display patterns of light and shadow on the table; bouncing balls leave images of rippling water; and the rhythm of play drives accompanying music and visuals. In the process, this project explores new ways to couple athletic recreation and social interaction",
        "score": 0.213370022579002,
        "scaled_score": 0.213370022579002,
        "id": 515
    },
    {
        "title": "Palimpsest",
        "url": "-",
        "content": "Palimpsest. A palimpsest is a manuscript consisting of a later writing superimposed upon an original writing. This name has been borrowed for the title of this project that aims to superimpose layers of recorded social interaction and present them as a single image. In contrast to conferencing tools and portals that enable chance encounters between distant locations, the palimpsest facilitates chance encounters between different points in time.",
        "score": 0.725295751015136,
        "scaled_score": 0.725295751015136,
        "id": 526
    },
    {
        "title": "Drum Network",
        "url": "-",
        "content": "Drum Network. The Drum Network provides players with a collaborative playing experience where participants can manipulate, share, and shape each others' music in real time. The drums in the network serve as controllers, sensing hitting and pressure that is then sent via a central system to other players. The drums also serve as speakers by using an attached actuator, which provides acoustic and tactile feedback.",
        "score": 0.119242373514988,
        "scaled_score": 0.119242373514988,
        "id": 535
    },
    {
        "title": "Hyperviolin: Real-Time Timbre Analysis/Synthesis",
        "url": "http://www.media.mit.edu/~tristan/",
        "content": "Hyperviolin: Real-Time Timbre Analysis/Synthesis. This project creates a synthesis engine that predicts the timbre of arbitrary acoustic instruments. Musically meaningful, it is controlled by the perceptual features extracted from the audio stream of an acoustic or electric violin in real-time. The timbre models are built from the analysis of pitch, loudness, brightness, and the instantaneous power spectrum of real recordings. Although highly compressed, the sound quality is fully preserved. Additionally, the playability remains smooth, expressive, predictable, and adequate for sound morphing.",
        "score": 0.156359547922376,
        "scaled_score": 0.156359547922376,
        "id": 536
    },
    {
        "title": "Social Polling of Immediate Surroundings",
        "url": "-",
        "content": "Social Polling of Immediate Surroundings. People are experts in social intelligence. Most know what is socially appropriate in a given situation, especially how to gauge if something is important enough to interrupt a conversation. People usually also know what kind of social situation they are in and, for example, if it is appropriate to take phone calls. We have built a system that allows an intelligent call-handling agent to \"ask\" the participants in a face-to-face conversation with the user in a very subtle way—a wirelessly actuated, vibrating finger ring—if an interruption from a mobile communication device would be appropriate. All involved people are given the possibility to \"veto\" an incoming communication anonymously in an equally subtle way, by touching their finger ring. This shifts the burden of deciding to interrupt or not away from the agent and toward the humans actually involved in a conversation.",
        "score": 0.0577723453620977,
        "scaled_score": 0.0577723453620977,
        "id": 544
    },
    {
        "title": "MITes: Wireless State-Change Sensors",
        "url": "http://web.media.mit.edu/~emunguia/portfolio/html/wsensors.htm",
        "content": "MITes: Wireless State-Change Sensors. One of the methods to recognize human activity is to place sensors in the environment. We have developed wireless sensors that measure acceleration (movement) as well as open-close events, so that the interaction of an individual with the environment can be measured. When someone carries out an activity, that person interacts with the environment--opening and closing drawers, cabinets, containers, or sitting on a couch. The timing and sequence of those activations can be used to recognize what activity a person is carrying out. This approach has some advantages, such as fewer privacy concerns (compared with the use of cameras and audio); in addition, it is less intrusive (for people suffering from dementia or mental illnesses).",
        "score": 0.511828140057136,
        "scaled_score": 0.511828140057136,
        "id": 546
    },
    {
        "title": "Microfluidic Logic",
        "url": "-",
        "content": "Microfluidic Logic. This project aims to demonstrate rapid-prototyping of logic gates in the field. We are working on a candidate mechanism of microfluidic logic at low Reynolds numbers. Cascades of appropriate, simple, nonlinear elements allow synthesis of any logic arbitrary nonlinear function. We are using the nonlinear medium of air because it is so readily available. We are studying Newtonian fluid flow at low Reynolds numbers in specially designed micro-geometries ranging from 100 microns to a few microns. Fluidic Logic was an active field of research in the 60s and 70s, but died prematurely because it could not keep up with the shrinking sizes and improved performance of electronic circuits. Current manufacturing processes can easily create extremely small feature sizes, made possible by increasing the resolution of precision machines and improved metrology techniques.",
        "score": 0.324479842370259,
        "scaled_score": 0.324479842370259,
        "id": 548
    },
    {
        "title": "Time-Critical Networks for Interaction Design",
        "url": "-",
        "content": "Time-Critical Networks for Interaction Design. Computer games and learning environments increasingly involve humans relating to computational avatars and robots. Intelligence-modeling software requires real-time interaction between the parts, with channel capacities that must match the best of human-human performance. Many multi-modal activities challenge the real-time communication and comprehension speeds between participants. This project aims to enhance human-machine and machine-machine communication capacities between entities in order to encourage new models of interaction.",
        "score": 0.194812154659616,
        "scaled_score": 0.194812154659616,
        "id": 572
    },
    {
        "title": "Flame Channel",
        "url": "http://www.truonex.com/projects/1560",
        "content": "Flame Channel. We found a very nice Bang & Olufsen TV in the trash and decided to use that for this project. We had a very hard time figuring out what to do with the television since it is difficult to not to think about the original use. We brainstormed and came up with a lot of ideas, but couldn’t find anything we were all totally satified with. We ended up doing the “Tinker it” method as Massimo Banzi calls it; that is to start building without knowing where you are going – with an added bit of surrealism.",
        "score": 0.777800285597332,
        "scaled_score": 0.777800285597332,
        "id": 580
    },
    {
        "title": "Truth Goggles",
        "url": "http://www.truonex.com/projects/1369",
        "content": "Truth Goggles. Truth Goggles attempts to decrease the polarizing effect of perceived media bias by forcing people to question all sources equally by invoking fact -checking services at the point of media consumption. Readers will approach even their most trusted sources with a more critical mentality by viewing content through various \"lenses\" of truth.",
        "score": 0.152592697184167,
        "scaled_score": 0.152592697184167,
        "id": 586
    },
    {
        "title": "Second Skin: Motion Capture with Actuated Feedback for Motor Learning",
        "url": "http://www.truonex.com/projects/1368",
        "content": "Second Skin: Motion Capture with Actuated Feedback for Motor Learning. We have created a 3D motion-tracking system with an automatic, real-time vibrotactile feedback with an assembly of photo-sensors, infrared projector pairs, vibration motors, and wearable suit. This system allows us to enhance and quicken the motor learning process in variety of fields such as healthcare (physiotherapy), entertainment (dance), and sports (martial arts).",
        "score": 0.49711119209299,
        "scaled_score": 0.49711119209299,
        "id": 587
    },
    {
        "title": "NETRA: Smartphone Add-On for Eye Tests",
        "url": "http://www.truonex.com/projects/1367",
        "content": "NETRA: Smartphone Add-On for Eye Tests. Can a person look at a portable display, click on a few buttons, and recover his refractive condition? Our optometry solution combines inexpensive optical elements and interactive software components to create a new optometry device suitable for developing countries. The technology allows for early, extremely low-cost, mobile, fast, and automated diagnosis of the most common refractive eye disorders: myopia (nearsightedness), hypermetropia (farsightedness), astigmatism, and presbyopia (age-relat",
        "score": 0.146913836731236,
        "scaled_score": 0.146913836731236,
        "id": 590
    },
    {
        "title": "ScratchEd",
        "url": "http://www.truonex.com/projects/1366",
        "content": "ScratchEd. As Scratch proliferates through the world, there is a growing need to support learners. But for teachers, educators, and others who are primarily concerned with enabling Scratch learning, there is a disconnect between their needs and the resources that are presently available through the Scratch Web site. ScratchEd is an online environment for Scratch educators to share stories, exchange resources, ask questions, and find people.",
        "score": 0.402233342463654,
        "scaled_score": 0.402233342463654,
        "id": 591
    },
    {
        "title": "Linear Mandala",
        "url": "http://www.truonex.com/projects/1360",
        "content": "Linear Mandala. In Linear Mandala, a single participant wears a custom headset outfitted with an electroencephalography (EEG) sensor. The participant walks alongside a row of monitors and speakers. Video, sound, and the physical headset are designed to support contemplation. In real time, a shadow-like avatar pushes a ball of objects representing each participant's brain activity. The participant must maintain a consistent brain state for the avatar and ball to move forward in tandem with his physical movement.",
        "score": 0.949473684198081,
        "scaled_score": 0.949473684198081,
        "id": 593
    },
    {
        "title": "LuminAR",
        "url": "http://www.truonex.com/projects/1298",
        "content": "LuminAR. LuminAR reinvents the traditional incandescent bulb and desk lamp, evolving them into a new category of robotic, digital information devices. The LuminAR Bulb combines a Pico-projector, camera, and wireless computer in a compact form factor. This self-contained system enables users with just-in-time projected information and a gestural user interface, and it can be screwed into standard light fixtures everywhere. The LuminAR Lamp is an articulated robotic arm, designed to interface with the Lum",
        "score": 0.268104057925166,
        "scaled_score": 0.268104057925166,
        "id": 610
    },
    {
        "title": "Line of Sound",
        "url": "http://www.truonex.com/projects/1297",
        "content": "Line of Sound. We show how data can be used to deliver sound information only in the direction in which one looks. The demonstration is done using two 55-inch screens which are transmitting both human and machine relevant information. Each screen is used to show a video which flashes a single bit indicator which transmits to a camera mounted on headphones. This is used to distinguish between the two screens, and to correlate an audio track to the video track.",
        "score": 0.401161242892837,
        "scaled_score": 0.401161242892837,
        "id": 619
    },
    {
        "title": "Electronic Popables",
        "url": "http://www.truonex.com/projects/2034",
        "content": "Electronic Popables. Electronic Popables is an interactive pop-up book that sparkles, sings, and moves. The book integrates traditional pop-up mechanisms with thin, flexible, paper-based electronics and the result is a book that looks and functions much like an ordinary pop-up with the added element of dynamic interactivity.",
        "score": 0.0996217998491358,
        "scaled_score": 0.0996217998491358,
        "id": 640
    },
    {
        "title": "Energize – Feedback Socket",
        "url": "http://www.truonex.com/projects/1588",
        "content": "Energize – Feedback Socket. During the day we use several kinds of electrical equipment like kitchen blenders, irons and coffee machines. What the user might not know is how much power the appliances consume while they are being used. Coordinating the necessary time of use is a difficult task. Energize, an electronic socket, provides a quick visual feedback, giving the user real time information about the amount of power consumed.",
        "score": 0.616661970633309,
        "scaled_score": 0.616661970633309,
        "id": 653
    },
    {
        "title": "Borntro",
        "url": "http://www.truonex.com/projects/2102",
        "content": "Borntro. 64kb intro, released at Symphony 2004 demoscene party, 1st place. All textures, models and animations were procedurally generated.",
        "score": 0.807999999926086,
        "scaled_score": 0.807999999926086,
        "id": 667
    },
    {
        "title": "Jeux Deux",
        "url": "-",
        "content": "Jeux Deux. Jeux Deux is an interactive concerto for Hyperpiano, Orchestra, and Live Computer Images. Utilizing novel software, Jeux Deux allows a virtuosic pianist to interact with a real acoustic piano (Yamaha Disklavier) in real-time, creating sounds and textures that are unplayable by a human player alone. Live computer graphics are generated in real-time from the piano's data and projected above the performer.",
        "score": 0.402748928976867,
        "scaled_score": 0.402748928976867,
        "id": 684
    },
    {
        "title": "BitChimes: Ambient Auditory Remote Awareness",
        "url": "-",
        "content": "BitChimes: Ambient Auditory Remote Awareness. BitChimes is an embodied ambient audio based remote awareness system. The gentle random tinkling of a set of chimes is used to create a soothing ambient soundscape, upon which small melodies are rendered to allow the user to monitor one or more remote location. By co-opting a wind chime, an artifact meant to provide ambient audio output, the BitChimes are capable of grounding the display more strongly than purely synthetically produced sounds generally used in ambient displays. The BitChimes design employs only the innate affordances of the object in order to provide notification, thus reducing initial cognitive costs, and without relying on difficult-to-understand behavior.",
        "score": 0.0566514585827459,
        "scaled_score": 0.0566514585827459,
        "id": 690
    },
    {
        "title": "EFRI-ARESC",
        "url": "http://www.truonex.com/projects/1962",
        "content": "EFRI-ARESC. This project envisions a manufacturing process where the relationship between the target structure and the source materials is defined indirectly, and where the path between them is subject to fluctuations requiring strategic decisions. Consider the challenge of constructing a structure that needs to support a specified load, given a pile of components of a known statistical distribution. While the target structure is being constructed, the distribution of raw components may change, requiring a",
        "score": 0.274375074083039,
        "scaled_score": 0.274375074083039,
        "id": 708
    },
    {
        "title": "Cow Herding with Virtual Fences",
        "url": "http://www.truonex.com/projects/1969",
        "content": "Cow Herding with Virtual Fences. Our system uses a directional sound system to indicate when a cow is approaching the virtual fence. If the animal does not respond to the sound queue a small directional shock is applied. Preliminary experiments show that the cattle learn quickly to respond to the sound and rarely need to be reinforced with the shock. Limits on the total number of sound and shock queues are enforced to prevent stressing the animal. As such, our system still requires perimeter fencing, but less division on th",
        "score": 0.137290369376671,
        "scaled_score": 0.137290369376671,
        "id": 713
    },
    {
        "title": "Suffrage",
        "url": "http://www.truonex.com/projects/1601",
        "content": "Suffrage. What is it? Suffrage wants to narrate the history of Italy. It visually represents the evolution of Italy through the growth and decline, glory and shame, rise and death of Italian political parties.",
        "score": 0.01,
        "scaled_score": 0.01,
        "id": 718
    },
    {
        "title": "ID/entity",
        "url": "-",
        "content": "ID/entity. In the Renaissance, kings rarely traveled to find a bride rather an artist was sent to paint her likeness. These artisans were often not the official court painter but lesser known ones who also illuminated manuscripts as their highly refined trade. One particular Netherlands family established a workshop serving the British monarch, Henry the VIII. They produced miniature portraits called Limnings, setting a trend that would continue in England and on the Continent for centuries. For today’s celebrated personages, Digital Limnings are also miniature memories where the past is stored in the present.",
        "score": 0.140655337995692,
        "scaled_score": 0.140655337995692,
        "id": 725
    },
    {
        "title": "Human Motion Signatures",
        "url": "http://www.media.mit.edu/~maov/",
        "content": "Human Motion Signatures. Given motion capture samples of Charlie Chaplin's walk, is it possible to synthesize other motions—say, ascending or descending stairs—in his distinctive style? More generally, in analogy with handwritten signatures, do people have characteristic motion signatures that individualize their movements? If so, can these signatures be extracted from example motions? Furthermore, can extracted signatures be used to recognize, say, a particular individual's walk subsequent to observing examples of other movements produced by this individual? We are developing an algorithm that extracts motion signatures and uses them in the animation of graphical characters. For example, given a corpus of walking, stair ascending, and stair descending motion data collected over a group of subjects, plus a sample walking-motion for a new subject, our algorithm can synthesize never-before-seen ascending and descending motions in the distinctive style of this new individual.",
        "score": 0.495267760402649,
        "scaled_score": 0.495267760402649,
        "id": 732
    },
    {
        "title": "AgoraPhone",
        "url": "http://www.media.mit.edu/~monster/AgoraPhone",
        "content": "AgoraPhone. The first of this project's two goals is to enable those with internalized, psychologically distressing states to speak their own stories out loud to others without fear. The second goal involves understanding the “architecture— of current public spaces, both physical and online, and designing the structure and interaction of a physically located audiospace project that enables and encourages citizens to respond easily, and to be responsible towards each other in urban public places. This project revolves around the design and building of a public installation to let people call from any touch-tone phone into a public space. At the site of this public space will be a sculpture of sorts–a physical tele-presence for the person calling. The person calling will actually speak out of the physical sculpture. A full duplex audio link will be opened up between the caller and the tele-presence sculpture via existing telephone infrastructures. People in the public space can talk with the remote caller by talking to the sculpture. This project brings the privacy and anonymity of online communication into a physical public space to facilitate emotional processing by individuals. Public disclosure of private information may open dialogues around topics otherwise private or dangerous. Individuals may take steps towards dealing with personal situations while simultaneously offering public citizens voices articulating broadly pertinent issues. People present at the site of the tele-presence sculpture will be called upon to be responsive towards others while simultaneously feeling less alone in facing issues they may also be dealing with personally. Public spaces will potentially become more vital, and private issues less alienating.",
        "score": 0.0700918104352517,
        "scaled_score": 0.0700918104352517,
        "id": 739
    },
    {
        "title": "In Search of Wonder: Measuring Our Response to the Miraculous",
        "url": "http://magicseth.com/thesis",
        "content": "In Search of Wonder: Measuring Our Response to the Miraculous. The wonder that occurs while watching a good magic trick or admiring a gorgeous natural vista is a strong emotion that has not been well studied. Educators, media producers, entertainers, scientists and magicians could all benefit from a more robust understanding of wonder. A new model was developed, and an experiment was conducted to investigate how several variables affect how magic tricks are enjoyed. The experiment showed 70 subjects 10 videos of magic while recording their responses and reactions to the tricks. Some individuals were shown the explanations to the magic tricks to gauge their impact on enjoyment. The style of the presentation was varied between two groups to compare the effect of magic presented as a story to magic presented as a puzzle. Presentation style has an effect on magic enthusiasts' enjoyment and a story-oriented presentation is associated with individuals being more generous towards a charity.",
        "score": 0.174668127621884,
        "scaled_score": 0.174668127621884,
        "id": 740
    },
    {
        "title": "Classification of Killer Whale Sounds with GMM and HMM",
        "url": "-",
        "content": "Classification of Killer Whale Sounds with GMM and HMM. The automatic classification of marine mammal sounds is very attractive as a means of assessing massive quantities of recorded data, freeing humans and offering rigorous and consistent output. Calculations on a set of vocalizations of Northern Resident killer whales using dynamic time warping have been reported recently. Since this method requires the time-consuming pre-processing measurement of frequency contours, we have explored the use of Gaussian Mixture Models (GMM) and Hidden Markov Models (HMM). These methods can be applied directly to time-frequency decompositions of the recorded signals. Calculations have been made on a set of 75 calls previously classified perceptually into seven call types. With cepstral coefficients as features both HMM’s and GMM’s give over 90% agreement with the perceptual classification, with the HMM over 95% for some cases.",
        "score": 0.298800025811029,
        "scaled_score": 0.298800025811029,
        "id": 748
    },
    {
        "title": "Between the Bars",
        "url": "http://www.truonex.com/projects/1350",
        "content": "Between the Bars. Between the Bars is a blogging platform for one out of every 142 Americans—prisoners—that makes it easy to blog using standard postal mail. It consists of software tools to make it easy to upload PDF scans of letters, crowd-sourced transcriptions of the scanned images. Between the Bars includes the usual full-featured blogging tools including comments, tagging, RSS feeds, and notifications for friends and family when new posts are available.",
        "score": 0.158256306292956,
        "scaled_score": 0.158256306292956,
        "id": 758
    },
    {
        "title": "CityCar Folding Chassis",
        "url": "http://www.truonex.com/projects/1355",
        "content": "CityCar Folding Chassis. The CityCar folding chassis is a half-scale working prototype that consists of four independently controlled in-wheel electric motors, four-bar linkage mechanism for folding, aluminum exoskeleton, operable front ingress/egress doors, lithium-nanophosphate battery packs, vehicle controls, and a storage compartment. The folding chassis can demonstrate compact folding (3:1 ratio compared to conventional vehicles), omni-directional driving, and wireless remote controls. The half-scale mock-up",
        "score": 0.373502610094136,
        "scaled_score": 0.373502610094136,
        "id": 762
    },
    {
        "title": "Who is Watching?",
        "url": "http://www.truonex.com/projects/2735",
        "content": "Who is Watching?. HDE Security provides the most dependable bathroom video surveillance concept on the market. While ordinary security systems rely on employees to monitor video streams, HDE sends video from highly insecure locations––such as bathrooms––into public areas so crime can be immediately exposed and eliminated. Give up your privacy for peace of mind. HDE Security provides the most dependable bathroom video surveillance concept on the market. While ordinary security systems rely on employees to monitor video streams, HDE sends video from highly insecure locations––such as bathrooms––into public areas so crime can be immediately exposed and eliminated. Give up your privacy for peace of mind. Engin Erdogan, Julie Hoffman, and I invented a bathroom video surveillance company, complete with brochures and a marketing video, to challenge how people think about privacy and security. As an exhibition during LCC Digital Media demo day, we put cameras in the men's bathroom and displayed the live feed in the public area.",
        "score": 0.0438338905557613,
        "scaled_score": 0.0438338905557613,
        "id": 776
    },
    {
        "title": "ShakeOnIt",
        "url": "http://obm.media.mit.edu",
        "content": "ShakeOnIt. We are exploring ways to encode information exchange into preexisting natural interaction patterns, both between people and between a single user and objects with which he or she interacts on a regular basis. Two devices are presented to provoke thoughts regarding these information interchange modalities: a pair of gloves that requires two users to complete a \"secret handshake\" in order to gain shared access to restricted information, and a doorknob that recognizes the grasp of a user and becomes operational if the person attempting to use it is authorized to do so.",
        "score": 0.177342086581763,
        "scaled_score": 0.177342086581763,
        "id": 793
    },
    {
        "title": "Hiriko CityCar with Denokinn",
        "url": "http://cp.media.mit.edu/",
        "content": "Hiriko CityCar with Denokinn. We are working with Denokinn to design and develop an integrated modular system for assembly and distribution of the CityCar. This project, based in the Basque region of Spain, will be called the \"Hiriko\" Project, which stands for Urban Car (Hiri = urban, Ko = coche or car in Basque). The goal of the Hiriko project is to create a new, distributed manufacturing system for the CityCar which will enable automotive suppliers to provide \"core\" components made of integrated modules such as in-wheel motor units, battery systems, interiors, vehicle control systems, vehicle chassis/exoskeleton, and glazing. A full-scale working prototype will be completed by the end of 2011 with an additional 20 prototypes to be built for testing in 2012. (Continuing the vision of William J. Mitchell).",
        "score": 0.0558248875543729,
        "scaled_score": 0.0558248875543729,
        "id": 794
    },
    {
        "title": "Tin Can",
        "url": "http://media.mit.edu/~dharry/tincan",
        "content": "Tin Can. Distributed meetings present a set of interesting challenges to staying engaged and involved. Because one person speaks at a time, it is easy (particularly for remote participants) to disengage from the meeting undetected. However, non-speaking roles in a meeting can be just as important as speaking ones, and if we could give non-speaking participants ways to participate, we could help support better-run meetings of all kinds. Tin Can collects background tasks like taking notes, managing the agenda, sharing relevant content, and tracking to-dos in a distributed interface that uses meeting participants' phones and laptops as input devices, and represents current meeting activities on an iPad in the center of the table in each meeting location. By publicly representing these background processes, we provide meeting attendees with new ways to participate and be recognized for their non-verbal participation.",
        "score": 0.0997757487089325,
        "scaled_score": 0.0997757487089325,
        "id": 795
    },
    {
        "title": "Map Scratch",
        "url": "-",
        "content": "Map Scratch. Map Scratch is an extension of Scratch that enables kids to program with maps within their Scratch projects. With Map Scratch, kids can create interactive tours, games, and data visualizations with real-world geographical data and maps.",
        "score": 0.772147683412241,
        "scaled_score": 0.772147683412241,
        "id": 817
    },
    {
        "title": "Morphable Structures",
        "url": "-",
        "content": "Morphable Structures. Granular materials can be put into a jammed state through the application of pressure to achieve a pseudo-solid material with controllable rigidity and geometry. While jamming principles have been long known, large-scale applications of jammed structures have not been significantly explored. The possibilities for shape-changing machines and structures are vast and jamming provides a plausible mechanism to achieve this effect. In this work, jamming prototypes are constructed to gain a better understanding of this effect. As well, potential specific applications are highlighted and demoed. Such applications range from a morphable chair, to a floor which dynamically changes its softness in response to a user falling down to reduce injury, to artistic free-form sculpting.",
        "score": 0.100513910320379,
        "scaled_score": 0.100513910320379,
        "id": 822
    },
    {
        "title": "Indoor Location Sensing Using Geo-Magnetism",
        "url": "-",
        "content": "Indoor Location Sensing Using Geo-Magnetism. We present an indoor positioning system that measures location using disturbances of the Earth's magnetic field by structural steel elements in a building. The presence of these large steel members warps the geomagnetic field such that lines of magnetic force are locally not parallel. We measure the divergence of the lines of the magnetic force field using e-compass parts with slight physical offsets; these measurements are used to create local position signatures for later comparison with values in the same sensors at a location to be measured. We demonstrate accuracy within one meter 88% of the time in experiments in two buildings and across multiple floors within the buildings.",
        "score": 0.356673852349464,
        "scaled_score": 0.356673852349464,
        "id": 823
    },
    {
        "title": "Non-photorealistic Camera: Depth Edge Detection and Stylized Rendering using Multi-Flash Imaging",
        "url": "http://www.truonex.com/projects/2329",
        "content": "Non-photorealistic Camera: Depth Edge Detection and Stylized Rendering using Multi-Flash Imaging. We present a non-photorealistic rendering approach to capture and convey shape features of real-world scenes. We use a camera with multiple flashes that are strategically positioned to cast shadows along depth discontinuities in the scene. The projective-geometric relationship of the camera-flash setup is then exploited to detect depth discontinuities and distinguish them from intensity edges due to material discontinuities. We introduce depiction methods that utilize the detected edge features",
        "score": 0.493908163713403,
        "scaled_score": 0.493908163713403,
        "id": 826
    },
    {
        "title": "Affective Circles",
        "url": "http://web.media.mit.edu/~atf/affective_circles/",
        "content": "Affective Circles. Affective Circles combines the Chat Circles 2 interface with affective information, including skin conductivity data, to enhance online communication.",
        "score": 0.837918290310208,
        "scaled_score": 0.837918290310208,
        "id": 827
    },
    {
        "title": "Greet",
        "url": "http://www.truonex.com/projects/2110",
        "content": "Greet. Another project from CIID Computational Design Course. The goal of this project was to use Processing to visualize data and use graphics created this way as a base for a poster. The data was gathered by attaching Wii Controler to hand and head of five people from five different countries. Then they shown a greeting typical in their culture. Each color is a visualization of another person. To control parameters of visualization I’ve used x and y acceleration of Wii Remote.",
        "score": 0.250273159151012,
        "scaled_score": 0.250273159151012,
        "id": 832
    },
    {
        "title": "Pattern",
        "url": "http://www.truonex.com/projects/2115",
        "content": "Pattern. Pattern is an installation that tries to reflect mood of work as programmer-artist. Hours, days and even weeks spend in front of computer form a steady rythm of pictures changing on the screen. Using projection, a screen of miniature laptop will become full of unique colors. Each of them represents different application that I used over last six months. This work represents a trend called 'personal informatics' where people collect, monitor and analyze data about themselves aiming for better und",
        "score": 0.185838114061212,
        "scaled_score": 0.185838114061212,
        "id": 835
    },
    {
        "title": "Metaphors – Icons and Representations",
        "url": "http://www.truonex.com/projects/1643",
        "content": "Metaphors – Icons and Representations. In this exercise, students groups of two were asked to create metaphors for common actions. Each group identified a control/button/lever in the CIID building and created a visual metaphor as a sketch – with the intention of changing the behaviour of the object influenced by the control.",
        "score": 0.116495769456263,
        "scaled_score": 0.116495769456263,
        "id": 844
    },
    {
        "title": "ProtoTouch: Multitouch Interfaces to  Everyday Objects",
        "url": "http://obm.media.mit.edu",
        "content": "ProtoTouch: Multitouch Interfaces to Everyday Objects. An assortment of everyday objects is given the ability to understand multitouch gestures of the sort used in mobile-device user interfaces, enabling people to use such increasingly familiar gestures to control a variety of objects, and to \"copy\" and \"paste\" configurations and other information among them.",
        "score": 0.331972118034143,
        "scaled_score": 0.331972118034143,
        "id": 851
    },
    {
        "title": "Hover",
        "url": "http://www.truonex.com/projects/2202",
        "content": "Hover. Hover is a device that enhances remote telecommunication by providing a sense of the activity and presence of remote users. The motion of a remote persona is manifested as the playful movements of a ball floating in midair. Hover is both a communication medium and an aesthetic object.",
        "score": 0.935999999704816,
        "scaled_score": 0.935999999704816,
        "id": 875
    },
    {
        "title": "Handsaw",
        "url": "http://www.truonex.com/projects/2200",
        "content": "Handsaw. Handsaw is a novel interaction technique for tangible exploration of volumetric data by direct cut-plane projection. An outstretched hand or a laser line projected onto a solid mass shows the resulting cross-sectional information on an adjacent screen. This interaction technique can be useful to help novices and experts work together on complex tasks such as understanding an MRI scan, electromagnetic radiation or climate patterns.",
        "score": 0.318304752515934,
        "scaled_score": 0.318304752515934,
        "id": 877
    },
    {
        "title": "Floccus",
        "url": "http://www.truonex.com/projects/2441",
        "content": "Floccus. Floccus (Golan Levin, 1999). In 1999 I began to study the means by which dynamic graphical lines could convey a plausible sense of physicality. After some experimentation I developed a model for representing the underlying structure of \"physical\" lines, in which a finite-element, mass-spring-damper simulation is composed of virtual particles connected by alternating linear and torsional springs. The model has the effect of simulating the tensile properties of thin physical filaments, such as hai",
        "score": 0.249071960188959,
        "scaled_score": 0.249071960188959,
        "id": 944
    },
    {
        "title": "Floccular Portraits",
        "url": "http://www.truonex.com/projects/2440",
        "content": "Floccular Portraits. Floccular Portraits (1999). In the Floccular Portrait system, filaments drawn by the user of Floccus are buffeted by forces derived from a hidden but underlying photograph. Light-colored filaments are attracted to bright regions of the photograph, while dark filaments are attracted to dark regions. I used these simple rules to coalesce piles of casual scribbles into several portraits of my colleagues. The results are wispy, organic and sometimes unsettling transformations: chiaroscuros in hair.",
        "score": 0.255385648516268,
        "scaled_score": 0.255385648516268,
        "id": 945
    },
    {
        "title": "Flow/er",
        "url": "http://www.truonex.com/projects/2050",
        "content": "Flow/er. Visuals created using a broken screen found in the trash.",
        "score": 0.010000000002734,
        "scaled_score": 0.010000000002734,
        "id": 974
    },
    {
        "title": "SpendTrend: Reflecting on Spending Habits",
        "url": "-",
        "content": "SpendTrend: Reflecting on Spending Habits. SpendTrend is a ReflectOn designed to allow its user to reflect on spending habits. Often we spend based on the momentary buying capability, without considering the long-term outcomes. Most would not think twice about a $4 Starbucks latte, but over a year this amount becomes non-trivial. Likewise, we often fail to think about savings in the long term. By making trends visible at the moment of purchase, SpendTrend attempts to make users mindful of their behavior and long-term goals. SpendTrend is built into a credit card, and has embedded processing and communication. The SpendTrend reader informs the card of the details of the purchases. With accurate, fine-grained information about purchases, the card then computes and display feedback, while also acting as a collection device for receipt data. The card harvests power directly from the reader, and has no explicit charging needs.",
        "score": 0.441647718167062,
        "scaled_score": 0.441647718167062,
        "id": 983
    },
    {
        "title": "Natural Language Understanding for MapTask",
        "url": "http://www.media.mit.edu/cogmac/projects/niu/index.html",
        "content": "Natural Language Understanding for MapTask. About a decade ago, University of Edinburgh and its partners put together a collection of transcribed human/human dialogues in which both participants were given similar maps. The person giving instructions had to navigate the other particpant along a path only on the giver's map. Since then, this corpus has been used for various tasks. To our knowledge, there have been no attempts to model actual understanding on the instruction receiver end; this study aims to fill this gap. We introduce Navigational Information Units (NIUs) describing individual intervals of the paths, drawn from several categories (such as \"moves\" and \"positions\"). Our first aim is to decompose these NIUs into a number of possibly independent constituents and ground the latter in terms of the objects on the maps. Having such models at hand, we can further employ the notion of context and try and replicate the entire paths as a sequence of extracted NIUs.",
        "score": 0.891266049609593,
        "scaled_score": 0.891266049609593,
        "id": 1011
    },
    {
        "title": "Space Diving",
        "url": "http://www.truonex.com/projects/1653",
        "content": "Space Diving. Haptics are an excellent but often overlooked form of user feedback. With some motors and software, this project simulated varying levels of “gravitational pull” towards different planets on the screen. When the user allows the control to hover over the planet, their avatar falls at the same rate they would on that planets surface.",
        "score": 0.472681600576601,
        "scaled_score": 0.472681600576601,
        "id": 1020
    },
    {
        "title": "Iceflake",
        "url": "http://www.truonex.com/projects/1652",
        "content": "Iceflake. The project builds on a playful imitation of the force feedback experience of buoyancy. Audio feedback is added to the interaction to increase the playfulness and fun of the interaction. The mental model builds on the image of an ice-flake gently surfacing the ocean.",
        "score": 0.33691511819545,
        "scaled_score": 0.33691511819545,
        "id": 1021
    },
    {
        "title": "Crossing the Fence",
        "url": "http://www.truonex.com/projects/1656",
        "content": "Crossing the Fence. Our research started from field observations and urban exploration that provided us with the backdrop for the central part of our project: the people of Vesterbro.",
        "score": 0.159620041921284,
        "scaled_score": 0.159620041921284,
        "id": 1025
    },
    {
        "title": "Chat Circles",
        "url": "http://chatcircles.media.mit.edu/",
        "content": "Chat Circles. Chat Circles is an abstract graphical interface for synchronous text conversation. Here, color and form are used to convey social presence and activity, and proximity-based filtering is used intuitively to break large groups into conversational clusters. The system also includes an integrated history interface, which visualizes archival Chat Circle logs. Our goal in this work is to create a richer environment for online discussions. We are currently revamping several of the chatroom's features to give our users more flexibility when setting up their own Chat Circles server.",
        "score": 0.290152416751344,
        "scaled_score": 0.290152416751344,
        "id": 1031
    },
    {
        "title": "LaserWho",
        "url": "-",
        "content": "LaserWho. LaserWho is large-scale gesture-based installation of the Visual Who project that uses the LaserWall for display and input. Users place anchors, each representing a different topic relevant to that community, on the screen. The names of people who are particularly drawn to a topic flow towards the associated anchor, and the resulting animation reveals the structure of the community in terms of shared interests and affiliations. Although LaserWho uses data visualization algorithms and techniques, the feel of this installation is very different than the typical analytic application. The image is shown on a large, rear-projection screen and its input is via the natural, intuitive gestures of picking up and placing objects. Music accompanies the visualization: each anchor has its own theme and the changing state of the system shapes and modulates the composition. LaserWho has been shown at Opera Totale in Venice and in New Orleans as part of the SIGGRAPH 2000 Emerging Technologies exhibition.",
        "score": 0.146140366194456,
        "scaled_score": 0.146140366194456,
        "id": 1033
    },
    {
        "title": "Chit Chat Club",
        "url": "-",
        "content": "Chit Chat Club. The Chit Chat Club is an experiment in bringing people together in a mixed physical and virtual environment. Online chatrooms and real world cafes are both venues for social interaction, but with significant differences, e.g., the participants' knowledge of each other's expressions and identity and the more governing introductions and turn-taking. Our goal is to create, through careful design of the physical environment and computer interface, a place that gracefully combines these two cultures. The analysis of how well this space actually functions will further our understanding of social interaction, both online and in person.",
        "score": 0.345029261192314,
        "scaled_score": 0.345029261192314,
        "id": 1038
    },
    {
        "title": "Plazza: Group Formation and Dynamic Content Distribution for Wireless and Mobile Systems",
        "url": "-",
        "content": "Plazza: Group Formation and Dynamic Content Distribution for Wireless and Mobile Systems. Plazza brings group formation and dynamic content distribution capabilities to broadband wireless devices, together with the illusion of infinite bandwidth and storage. Formerly restricted to PDA functionality, these devices dynamically discover content available in the wireless local network and other user's access patterns to it. Users can discover like-minded individuals or leverage implicit collaborative filtering to select the content they may be interested in, share the content with other stationary or mobile nodes, and view it in their devices or arrange for it to be transferred to their home node, where they can enjoy without battery or screen size constraints.",
        "score": 0.0892300270388783,
        "scaled_score": 0.0892300270388783,
        "id": 1069
    },
    {
        "title": "VisiGeek",
        "url": "http://www.media.mit.edu/~jim/projects/visigeek/",
        "content": "VisiGeek. The VisiGeek displayer enables the visual comparison of otherwise non-visual datasets. The visualizer highlights differences in the data using patterns, letter-shapes and motion. Applications of this type of visualization could include affinity-matching when searching for newsgroups or chat rooms to join, or visual sorting tasks such as identifying a desirable place to live using a back-end service such as a demographic database. The demonstration project's immediate goal is to allow a viewer to visually compare \"Geek Codes\" of two individuals to uncover differences and similarities.",
        "score": 0.466923759250868,
        "scaled_score": 0.466923759250868,
        "id": 1075
    },
    {
        "title": "InterestMap",
        "url": "http://web.media.mit.edu/~hugo/research/#corelate",
        "content": "InterestMap. While most recommender systems continue to gather detailed models of their “users— within their particular application domain, they are, for the most part, oblivious to the larger context of the lives of their users outside of the application. What are they passionate about as individuals, and how do they identify themselves culturally? As recommender systems become more central to people’s lives, we must start modeling the person, rather than the user. We harvested 100,000 social network profiles, in which people describe themselves using a rich vocabulary of their passions and interests; from this, we built a map of how interests and identities link together semantically to form a fabric. Using this \"InterestMap,\" it is possible to make inferences about people's identities and what two strangers meeting for the first time might have in common.",
        "score": 0.206208229631957,
        "scaled_score": 0.206208229631957,
        "id": 1078
    },
    {
        "title": "Tensor Displays: Compressive Light Field Synthesis using Multilayer Displays with Directional Backli",
        "url": "http://www.truonex.com/projects/2309",
        "content": "Tensor Displays: Compressive Light Field Synthesis using Multilayer Displays with Directional Backlighting. We introduce tensor displays: a family of compressive light field displays comprising all architectures employing a stack of time-multiplexed, light-attenuating layers illuminated by uniform or directional backlighting (i.e., any low-resolution light field emitter). We show that the light field emitted by an N-layer, M-frame tensor display can be represented by an Nth-order, rank-M tensor. Using this representation we introduce a unified optimization framework, based on nonnegative tensor factor",
        "score": 0.152858067562445,
        "scaled_score": 0.152858067562445,
        "id": 1093
    },
    {
        "title": "Patent Semantics",
        "url": "-",
        "content": "Patent Semantics. The automated processing of natural language by computer has become a paramount concern in nearly every field of human endeavor. The amount of information available in current literature and even the mass of information being generated on a daily basis is well beyond the scope of human understanding in any detail. Because of the sheer breadth of information, human analysis and curation of this information is rarely comprehensive and often error-prone. Machine-aided curation of this information could increase its utility by allowing more comprehensive analyses, more complete summarization, and extensive comparisons to current knowledge. Such curation requires a method for arriving at a high-level semantic description of the text at hand. Patent Semantics is an attempt to attack this problem in the domain of biochemical synthesis, by building structured representations of the procedures involved in different synthesis descriptions, grounding the components of those models, and developing algorithms by which detailed, human-readable comparisons of the descriptions may be produced.",
        "score": 0.533679627620341,
        "scaled_score": 0.533679627620341,
        "id": 1101
    },
    {
        "title": "Self-Cam",
        "url": "http://affect.media.mit.edu/projectpages/esp/",
        "content": "Self-Cam. The Self-Cam is a wearable camera apparatus that consists of a chest-mounted camera aimed at the wearer’s face. Self-Cam was designed to be used in conjunction with a belt-mounted computer and real-time mental-state inference software that can be used with visual, auditory, or tactile output as personal feedback for the wearer. As the camera faces inward, many privacy issues are avoided–only those who choose to wear the Self-cam appear in the recorded video. Head movement can be seen and analyzed alongside facial expressions because the system rests on the chest and the light, simple nature of the structure allows it to be worn without any physical discomfort. By wearing the Self-Cam, you can explore who you appear to be from the outside. The Self-Cam acts as an objective point of view that might help you to understand yourself in a different light.",
        "score": 0.107558876104412,
        "scaled_score": 0.107558876104412,
        "id": 1113
    },
    {
        "title": "Tin Can Classroom",
        "url": "http://www.truonex.com/projects/1337",
        "content": "Tin Can Classroom. Classroom discussions may not seem like an environment that needs a new kind of supporting technology. But we've found that augmenting classroom discussions with an iPad-based environment to help promote discussion, keep track of current and future discussion topics, and create a shared record of class keeps students engaged and involved with discussion topics, and helps restart the discussion when conversation lags. Contrary to what you might expect, having another discussion venue doesn't seem",
        "score": 0.105698252250533,
        "scaled_score": 0.105698252250533,
        "id": 1126
    },
    {
        "title": "ListenIn",
        "url": "http://www.media.mit.edu/speech/projects/listenin/",
        "content": "ListenIn. ListenIn uses audio to link two environments; it is motivated by the desire by caregivers to monitor domestic environments with elderly or infant occupants. Wireless microphones in the home collect sound, classify it, and then transmits either iconic representations of the sound, a few seconds of the sound itself, or, if the sound contains speech, a \"garbled\" version of the sound. The remote client plays these snippets of sound as background audio, allowing one to listen in while away from home as an occasional, ambient auditory experience.",
        "score": 0.12869842118622,
        "scaled_score": 0.12869842118622,
        "id": 1170
    },
    {
        "title": "Dencities",
        "url": "http://www.truonex.com/projects/2046",
        "content": "Dencities. A visualization of population density using a parametric typeface created with Processing. More information on this post: Dynamic Typeface",
        "score": 0.592782763951147,
        "scaled_score": 0.592782763951147,
        "id": 1177
    },
    {
        "title": "Earrings",
        "url": "http://www.truonex.com/projects/2048",
        "content": "Earrings. Sets of earrings made of (1) grinded and polished metal sheet, and (2) veneer and brass.",
        "score": 0.0133333333394346,
        "scaled_score": 0.0133333333394346,
        "id": 1179
    },
    {
        "title": "Writing your ABCs",
        "url": "http://www.truonex.com/projects/1790",
        "content": "Writing your ABCs. This project explores the differences in hand and arm movement between boys and girls as they write. Using a Wii remote we collected data from 10 girls and 10 boys writing A, B, C on an imaginary blackboard. This data was translated in to visuals using Processing. Each direction of movement was represented by a different circle that accumulated a new pattern throughout the movements.",
        "score": 0.475194258005859,
        "scaled_score": 0.475194258005859,
        "id": 1182
    },
    {
        "title": "Greetings",
        "url": "http://www.truonex.com/projects/1792",
        "content": "Greetings. Greetings from Five Different Countries: We asked people from Italy, India, Denmark, USA and Korea to perform greetings typical to their cultures. During these greetings, we strapped a Wii remote to their head and hand to measure and record acceleration.",
        "score": 0.247945278755201,
        "scaled_score": 0.247945278755201,
        "id": 1184
    },
    {
        "title": "-- Title Summary Primary Image",
        "url": "http://www.truonex.com/projects/1794",
        "content": "-- Title Summary Primary Image. In Processing, the recorded values from head and hand movements of different greeting gestures have been converted in to lines. The length of each line represents the values and these are mapped between respective angles of body movement. Finally all the movement maps are combined together in respect to the body.",
        "score": 0.366203000781581,
        "scaled_score": 0.366203000781581,
        "id": 1186
    },
    {
        "title": "Single Lens Off-Chip Cellphone Microscopy",
        "url": "-",
        "content": "Single Lens Off-Chip Cellphone Microscopy. Within the last few years, cellphone subscriptions have widely spread and now cover even the remotest parts of the planet. Adequate access to healthcare, however, is not widely available, especially in developing countries. We propose a new approach to converting cellphones into low-cost scientific devices for microscopy. Cellphone microscopes have the potential to revolutionize health-related screening and analysis for a variety of applications, including blood and water tests. Our optical system is more flexible than previously proposed mobile microscopes, and allows for wide field of view panoramic imaging, the acquisition of parallax, and coded background illumination, which optically enhances the contrast of transparent and refractive specimens.",
        "score": 0.0843108612503387,
        "scaled_score": 0.0843108612503387,
        "id": 1197
    },
    {
        "title": "Machine Therapy",
        "url": "-",
        "content": "Machine Therapy. Machine Therapy takes two forms: a series of wearable body organs (comforting armors) that are incorporated and used by participants, and the facilitation of live-action psychoanalytic sessions (therapy sessions) with motorized machines. By accessing and vitalizing the interplay of people and machines through psychotherapeutic techniques, a social awareness is presented and individuals are invited to question and reinvent their own existence and their relationships with the machines sharing their space. The Wearable Body Organs are a series of very visible, spectacular or carnival-like play-use objects, devices, or equipments. They offer context-sensitive functionality for their wearers, while simultaneously announcing their own need for existence through public use (without being hidden and small, as is the trend with consumer gadgets and self-helping devices). The Machine Sessions are sometimes private and sometimes public engagements/experiments/performances.",
        "score": 0.0708928576277515,
        "scaled_score": 0.0708928576277515,
        "id": 1207
    },
    {
        "title": "Effect of a Powered Ankle on Shock Absorption and Interfacial Pressure",
        "url": "-",
        "content": "Effect of a Powered Ankle on Shock Absorption and Interfacial Pressure. Lower-extremity amputees face a series of potentially serious post-operative complications. Among these are increased risk of further amputations, excessive stress on the unaffected and residual limbs, and discomfort at the human-prosthesis interface. Currently, conventional, passive prostheses have made strides towards alleviating the risk of experiencing complications, but we believe that the limit of “dumb” elastic prostheses has been reached; in order to make further strides we must integrate “smart” technology in the form of sensors and actuators into lower-limb prostheses. This project compares the elements of shock absorption and socket pressure between passive and active ankle-foot prostheses. It is an attempt to quantitatively evaluate the patient’s comfort.",
        "score": 0.646900731068215,
        "scaled_score": 0.646900731068215,
        "id": 1225
    },
    {
        "title": "TeleAction",
        "url": "http://smg.media.mit.edu/Projects/TeleActor/",
        "content": "TeleAction. We are developing a system that allows a group of distributed participants to direct the actions of a remote actor. This remote \"TeleActor\" is a telepresence agent, taking commands from the directors and sending audio and video back to them from the remote location. Research goals include designing interfaces for large groups of cooperating and competing individuals, developing complex telepresence command and feedback systems, and advancing our understanding of the interactions between the TeleActor and the real world. Our current focus is on TeleActor as a media agent for news broadcasting.",
        "score": 0.548165179152837,
        "scaled_score": 0.548165179152837,
        "id": 1234
    },
    {
        "title": "What's Up",
        "url": "http://llk.media.mit.edu/projects.php?id=1859",
        "content": "What's Up. What's Up is a neighborhood news system that combines power of the telephone and of the Web to make it easier for youth to organize community events and find out what is happening in the place where they live. By dialing a central number, youth can send and receive voicemail messages, publish audio community announcements, create voicemail groups, add events to a shared community calendar and more. When field tested in Lawrence, MA, What's Up helped increase awareness of and accessibility to important local youth resources, provided youth with opportunities to express their opinions about their neighborhoods and, with that, contributed to transform Lawrence into a community that is both friendlier and more empowering for young people.",
        "score": 0.0710440008011555,
        "scaled_score": 0.0710440008011555,
        "id": 1237
    },
    {
        "title": "The Work of Beryl Sokoloff",
        "url": "http://www.truonex.com/projects/1902",
        "content": "The Work of Beryl Sokoloff. For more than four decades in downtown New York City, Beryl Sokoloff (1918-2006) transformed raw shapes, colors, and sound into cinematic orbits of wonder. Under the direction of Beryl's partner, Crista Grauer, Ilias was the creative director for the boxed set of Beryl Sokoloff's work. (2003-2006)",
        "score": 0.174114084048391,
        "scaled_score": 0.174114084048391,
        "id": 1245
    },
    {
        "title": "Tangible Web",
        "url": "http://www.truonex.com/projects/2262",
        "content": "Tangible Web. Tangible WebLeonardo Bonanni Matthew Hockenberry Xiao Xiao Bianca Cheng Costanzo Andrew Shum / 2008",
        "score": 0.0100000000006367,
        "scaled_score": 0.0100000000006367,
        "id": 1249
    },
    {
        "title": "Shadow Catching",
        "url": "http://www.truonex.com/projects/1803",
        "content": "Shadow Catching. In this project my aim was to create an installation that would allow people to interact with a projection of their shadows. The SAS Royal Hotel has a very interesting space in the lobby which would be ideal for an installation which reacts to people as they enter the hotel.",
        "score": 0.211870278959813,
        "scaled_score": 0.211870278959813,
        "id": 1261
    },
    {
        "title": "deStillr 2.0",
        "url": "http://www.truonex.com/projects/2316",
        "content": "deStillr 2.0. deStillr would use a remote heart rate sensor to monitor the vital signs of viewers. Clips that trigger maximum emotional response from the viewer can then be learned and replayed en-masse. The result might look something like this:",
        "score": 0.116543278715361,
        "scaled_score": 0.116543278715361,
        "id": 1281
    },
    {
        "title": "BiDi Screen",
        "url": "http://www.truonex.com/projects/2311",
        "content": "BiDi Screen. The BiDi Screen is an example of a new type of I/O device that possesses the ability to both capture images and display them. This thin, bidirectional screen extends the latest trend in LCD devices, which has seen the incorporation of photo-diodes into every display pixel. Using a novel optical masking technique developed at the Media Lab, the BiDi Screen can capture lightfield-like quantities, unlocking a wide array of applications from 3-D gesture interaction with CE devices, to seamless video",
        "score": 0.371050383959264,
        "scaled_score": 0.371050383959264,
        "id": 1282
    },
    {
        "title": "TeleTouch",
        "url": "http://www.truonex.com/projects/1934",
        "content": "TeleTouch. TeleTouch lets you touch and control from far. See thru your smartphone's camera and control EVERYTHING you see on the screen by touching it. Now you can interact with your appliances from far, in a fun way. Here it goes. You look at a scene thru the camera of your smartphone and control what you see - home appliances (TV, alarm, music player, ...), Open the door; or turn on that light. Just by touching it on screen. It's simple. TeleTouch lets you interact with your world with touch, but now fr",
        "score": 0.0757388018791195,
        "scaled_score": 0.0757388018791195,
        "id": 1286
    },
    {
        "title": "Modular Platform for High-Density Wireless Sensing",
        "url": "http://www.media.mit.edu/resenv/Stack/",
        "content": "Modular Platform for High-Density Wireless Sensing. We have developed a simple modular platform for wireless sensing. This system allows for easy prototyping and testing of embedded sensor applications, and encapsulates much of the wireless system design and makes it reusable. All boards in the system are 1.4 inch square; the master board contains a 22 MIPS microcontroller with 12-bit ADC and a 115.2 kBps wireless link with TDMA channel sharing. A flash memory board is also available for local storage. Sensor boards can be attached to the master via a 26-pin fixed link, which provides for both direct and multiplexed connections, as well as a variety of other data protocols and power distribution. So far, constructed sensor boards include a six degree of freedom inertial measurement unit, a tactile (e.g., bend and pressure) sensor signal processing board, and a promixity sensing board based on both sonar and capacitve sensors. An ambient sensor (camera, IR, heat, sound) board is currently in testing. This platform has been used in a number of lab projects, including a wearable gait laboratory, a novel musical controller and an instrument plush bear.",
        "score": 0.0585144498068319,
        "scaled_score": 0.0585144498068319,
        "id": 1304
    },
    {
        "title": "Shaped Ultrafast Pulse Optical Pumping of NMR Systems",
        "url": "-",
        "content": "Shaped Ultrafast Pulse Optical Pumping of NMR Systems. Near-unity polarization of nuclear systems in atoms has been demonstrated via optical pumping. This relies on pumping specific absorption lines of atoms. Molecules are required to provide enough qubits for computations. Molecular absorption spectra are much more broadband, and therefore will require a more complex pumping signal in order to attain polarization. We will be investigating the feasibility of using shaped ultrafast optical pumping to improve nuclear polarization. High nuclear spin polarization is a route to increasing the number of qubits available and thereby the usefulness of NMR quantum computers.",
        "score": 0.21243173822383,
        "scaled_score": 0.21243173822383,
        "id": 1306
    },
    {
        "title": "Object-Based Media",
        "url": "http://obm.media.mit.edu",
        "content": "Object-Based Media. Our group explores how the distribution of computational intelligence throughout video and audio communication systems can make a richer connection between the people at each end. We conduct research into the future of electronic visual communication and expression, and ways to make a richer connection among the people at the ends of the system, whether a broadcast system or a peer-to-peer environment. We also develop hardware and software technologies to support the requirements of such a scenario, with particular focus on new input and output technologies, advanced interfaces for consumer electronics, and self-organization among smart devices.",
        "score": 0.0953424579652888,
        "scaled_score": 0.0953424579652888,
        "id": 1322
    },
    {
        "title": "InterPlay: Full-Body Interaction Platform",
        "url": "http://www.truonex.com/projects/1329",
        "content": "InterPlay: Full-Body Interaction Platform. InterPlay is a platform for designers to create dynamic social simulations that transform public spaces into immersive environments where people become the central agents. It uses computer vision and projection to facilitate full-body interaction with digital content. The physical world is augmented to create shared experiences that encourage active play, negotiation, and creative composition.",
        "score": 0.199879801453458,
        "scaled_score": 0.199879801453458,
        "id": 1327
    },
    {
        "title": "Compressive Sensing for Visual Signals",
        "url": "http://www.truonex.com/projects/1328",
        "content": "Compressive Sensing for Visual Signals. Research in computer vision is riding a new tide called compressive sensing. Carefully designed capture methods exploit the sparsity of the underlying signal in a transformed domain to reduce the number of measurements and use an appropriate reconstruction method. Traditional progressive methods capture successively more detail using sequence of simple projection basis whereas random projections do not use any sequence except l0 minimization for reconstruction which is computationally in-efficie",
        "score": 0.190882632880886,
        "scaled_score": 0.190882632880886,
        "id": 1328
    },
    {
        "title": "Rectified Flowers",
        "url": "http://www.truonex.com/projects/2465",
        "content": "Rectified Flowers. Kyle McDonald and I were reading about domain shifting between polar and Cartesian geometries, and noticed that flowers make particularly interesting subjects for this transformation. Abusing my open-source BloggieUnwarper panoramic-imaging software with some flower photographs from Flickr, we produced the \"flower panoramas\" below. This is what one would see if one were doing panoramic imaging from inside a flower...",
        "score": 0.183608654367125,
        "scaled_score": 0.183608654367125,
        "id": 1334
    },
    {
        "title": "Chaniltonians",
        "url": "http://www.media.mit.edu/~aram/chaniltonian/",
        "content": "Chaniltonians. We are studying the communication capacities of unitary two-party unitary quantum interactions. We have found expressions for their one-way classical and quantum capacities assisted by an arbitrary amount of entanglement per use of the gate. More importantly, classical communication using unitary methods has turned out to be a useful abstraction for studying other problems in quantum information theory. This abstraction, called \"coherent classical communication,\" has led to short proofs of many of the central results in the field, and allowed the unification of several problems in quantum information theory.",
        "score": 0.15927811539874,
        "scaled_score": 0.15927811539874,
        "id": 1347
    },
    {
        "title": "Natural interactions with spatially aware devices",
        "url": "http://www.truonex.com/projects/1499",
        "content": "Natural interactions with spatially aware devices. Despite how well virtually connected our devices are (iCloud, Dropbox, …), they still lack a tangible connection. A (representation of a) physical connection of those devices would facilitate a more intuitive interaction built on traditional mental models from the physical world. That’s one of the main reasons why kids interact with iPad so naturally, because it uses interfaces based on natural, tangible interactions.",
        "score": 0.169759225455106,
        "scaled_score": 0.169759225455106,
        "id": 1348
    },
    {
        "title": "Sonic Authority",
        "url": "http://www.media.mit.edu/~nvawter/projects/SonicAuthority",
        "content": "Sonic Authority. In this project, human-built spaces such as parks are acoustically analyzed and then permanently and publicly labeled.",
        "score": 0.0200000000019003,
        "scaled_score": 0.0200000000019003,
        "id": 1359
    },
    {
        "title": "NeverEnding Drawing Machine",
        "url": "http://web.media.mit.edu/~lifeform/NeverendingDrawing-small.mov",
        "content": "NeverEnding Drawing Machine. Inspired by the Surrealists' Exquisite Corpse art game, the NeverEnding Drawing project is one of several applications developed on a scalable architecture and platform for collaborative creativity. Users co-create and edit each other's augmented sketchbooks in real time. By tracking individual pages of each live sketchbook, the system loads the appropriate background audiovisual content and enables users to add to it using a variety of real materials and means of mark-making. Users take pictures and record sounds to be sent back and forth between collaborators on the network. Additionally, the live sketchbooks facilitate non-linear, asynchronous access to the evolving, co-created content through their physical editing interface. By using crayons, colored pens, and various tactile and light-diffusing materials, the analog/digital hybrid model of content creation requires no expertise and creates a safe environment for sharing unfinished work with others.",
        "score": 0.11670539784507,
        "scaled_score": 0.11670539784507,
        "id": 1372
    },
    {
        "title": "Doodle-Drink-Assembler",
        "url": "http://www.truonex.com/projects/1786",
        "content": "Doodle-Drink-Assembler. By tracking the movement of your brush (a Wii remote) while you draw, the Doodle-Drink-Assembler records your movement across each axis (yawn, pitch, roll, tilt-up and tilt-down) and stores each individual movement in the one of the 5 ‘axis-tanks’. When you are finished, the Assembler calculates the ratio between the amounts stored in the 5 tanks, converting them into 5 different ingredients (lemon, liquor, sparkling water, color and juice). The Assembler then shows you (and the bartender mixing",
        "score": 0.151993547417844,
        "scaled_score": 0.151993547417844,
        "id": 1375
    },
    {
        "title": "Ping Ping Pong",
        "url": "http://www.truonex.com/projects/1788",
        "content": "Ping Ping Pong. Ping Ping Pong is a game controlled by a Wii remote. There is one with a ball on the screen. When you shake the wii, two more balls appear. The idea is to discover how to move the balls to reach the border on the screen.",
        "score": 0.394447745777349,
        "scaled_score": 0.394447745777349,
        "id": 1388
    },
    {
        "title": "Designing Immersive Multi-Sensory Eating Experiences",
        "url": "-",
        "content": "Designing Immersive Multi-Sensory Eating Experiences. Food offers a rich multi-modal experience that can deeply affect emotion and memory. We're interested in exploring the artistic and expressive potential of food beyond mere nourishment, as a means of creating memorable experiences that involve multiple senses. For instance, music can change our eating experience by altering our emotions during the meal, or by evoking a specific time and place. Similarly, sight, smell, temperature can all be manipulated to combine with food for expressive effect. In addition, by drawing upon people's physiology and upbringing, we seek to create individual, meaningful sensory experiences.",
        "score": 0.0332003735121135,
        "scaled_score": 0.0332003735121135,
        "id": 1389
    },
    {
        "title": "Pillow-Talk",
        "url": "-",
        "content": "Pillow-Talk. Pillow-Talk is the first of a series of objects designed to aid creative endeavors through the unobtrusive acquisition of unconscious self-generated content to permit reflexive self-knowledge. Composed of a seamless recording device embedded in a pillow, and a playback and visualization system in a jar, Pillow-Talk crystallizes that which we normally forget. This allows users to capture their dreams in a less mediated way, aiding recollection by priming the experience and providing no distraction for recall and capture through embodied interaction.",
        "score": 0.283451924770534,
        "scaled_score": 0.283451924770534,
        "id": 1399
    },
    {
        "title": "TRUSS: Tracking Risk with Ubiquitous Smart Sensing",
        "url": "-",
        "content": "TRUSS: Tracking Risk with Ubiquitous Smart Sensing. We are developing a system for inferring safety context on construction sites by fusing data from wearable devices, distributed sensing infrastructure, and video. Wearable sensors stream real-time levels of dangerous gases, dust, noise, light quality, precise altitude, and motion to base stations that synchronize the mobile devices, monitor the environment, and capture video. Context mined from these data is used to highlight salient elements in the video stream for monitoring and decision support in a control room. We tested our system in a initial user study on a construction site, instrumenting a small number of steel workers and collecting data. A recently completed hardware revision will be followed by further user testing and interface development.",
        "score": 0.14621583761241,
        "scaled_score": 0.14621583761241,
        "id": 1430
    },
    {
        "title": "SP3X",
        "url": "http://www.truonex.com/projects/2251",
        "content": "SP3X. SP3X is a new type of three-dimensional interface for creating, modifying, and navigating volumetric data. It combines the intuitive and improvisational strengths of tangible interfaces with the visualization power of mixed reality. Users can create 3D models by defining cross sectional slices. Users wear a head-mounted display that allows them to see virtual objects, like the model they are creating, overlaid on the real world. Interaction takes place through a hexapod structure with six-degree",
        "score": 0.249064997935952,
        "scaled_score": 0.249064997935952,
        "id": 1448
    },
    {
        "title": "Tangible query interfaces",
        "url": "http://www.truonex.com/projects/2259",
        "content": "Tangible query interfaces. This project is developing new means for querying relational databases and live datastreams through the manipulation of physical objects. Parameterized query fragments are embodied as physical tokens (“parameter wheels”). These tokens are manipulated, interpreted, and graphically augmented on a series of sliding racks. Token rotation maps to parameter selection; token adjacencies maps to Boolean AND/OR operations; token ordering maps to result sorting; and individual racks map to parenthetical g",
        "score": 0.41893320602864,
        "scaled_score": 0.41893320602864,
        "id": 1453
    },
    {
        "title": "Tunnel 1K",
        "url": "http://www.truonex.com/projects/2099",
        "content": "Tunnel 1K. My contribution to js1k compo. The idea was to create something in Java Script in 1KB. My choice was obvious because there is no demo compo without a wobbling tunnel!",
        "score": 0.0100000000017207,
        "scaled_score": 0.0100000000017207,
        "id": 1463
    },
    {
        "title": "Femto-Photography: Visualizing Photons in Motion at a Trillion Frames Per Second",
        "url": "http://www.truonex.com/projects/2325",
        "content": "Femto-Photography: Visualizing Photons in Motion at a Trillion Frames Per Second. Ripples",
        "score": 0.0100000000014542,
        "scaled_score": 0.0100000000014542,
        "id": 1476
    },
    {
        "title": "document.write(textArray[0]);EyeNETRA",
        "url": "http://www.truonex.com/projects/1921",
        "content": "document.write(textArray[0]);EyeNETRA. document.write(textArray[1]);Eye Care in the Palm of Your Hand",
        "score": 0.0133333333389617,
        "scaled_score": 0.0133333333389617,
        "id": 1481
    },
    {
        "title": "The Tower: A Modular Electronics Design Environment",
        "url": "http://gig.media.mit.edu/projects/tower/",
        "content": "The Tower: A Modular Electronics Design Environment. The Tower is a modular development system for designing and prototyping computational devices. Physically, the Tower consists of a primary foundation layer with a central processor. At this point, two foundations are available, equipped with either the PIC16F877 microcontroller from Microchip Inc.™, or the Rabbit™ 2300 processor from Rabbit Semiconductor™. Additional modules can be added to the stack as needed by specific applications, and a special prototyping layer allows for simplified design of new modules for the system. Currently, layers are being produced that allow for sensor readings, servo-motor control, MIDI music playback, data collection, network connectivity, and RF and infrared communication. In addition to the currently available layers, we are actively designing a set of hardware and software development tools to make it easy for anyone to add their own layers to the system as an application's needs require.",
        "score": 0.0424278999947874,
        "scaled_score": 0.0424278999947874,
        "id": 1507
    },
    {
        "title": "inCall: Exploring the Role of Context in Communication",
        "url": "-",
        "content": "inCall: Exploring the Role of Context in Communication. This project addresses the question of how we can build a new style of telephone-like communications system that uses data shared among all of the users to make an architecture for new services. The system is made up of an infrastructure that facilitates the acquisition and exchange of user context information called Sensorama, and an IP-based telephony application based on this infrastructure.",
        "score": 0.171669722567832,
        "scaled_score": 0.171669722567832,
        "id": 1508
    },
    {
        "title": "Who's Got Game?",
        "url": "-",
        "content": "Who's Got Game?. Many people play strategy games against computer opponents, but don’t have a clear understanding of how they function. Building your own Deep Blue is a formidable challenge, but is perhaps a good way to learn the computer science and mathematics of decision making. Since most people aren’t computer scientists, they need a way to describe game strategies so they can be executed by a computer they can play against. This research features a graphic toolkit for designing strategy-games and computer opponents, tailored to support learning artificial intelligence techniques for deciding which next moves are better than others. The demonstration of the toolkit is complemented by initial results of a study of how kids articulate their strategies and modify them after seeing their effect on game play.",
        "score": 0.253225443321189,
        "scaled_score": 0.253225443321189,
        "id": 1510
    },
    {
        "title": "What Would They Think?",
        "url": "-",
        "content": "What Would They Think?. The system consists of virtual representations of a handful of people that react to what a person is currently reading, writing, or talking about. These \"digital personas\" are constructed automatically by analyzing personal texts (such as interviews/blogs/messages posted by the person being modeled) using natural language processing techniques and the Open Mind Common Sense knowledge base. The \"What Would They Think?\" system has several applications. For example, it can help a person form a deep understanding of a community that is new to them by constantly showing them the attitudes and disagreements of strong personalities of that community. Other applications include virtual \"mentors\" or \"guides,\" and knowledge-sharing in communities and workgroups.",
        "score": 0.32135399625185,
        "scaled_score": 0.32135399625185,
        "id": 1511
    },
    {
        "title": "Boundary Functions",
        "url": "http://www.truonex.com/projects/2526",
        "content": "Boundary Functions. We think of personal space as something that belongs entirely to ourselves. However, Boundary Functions shows us that personal space exists only in relation to others and changes without our control.Boundary Functions is a set of lines projected from overhead onto the floor, dividing people in the gallery from one another. When there is one person on its floor, there is no response. When two are present, a single line cuts between them bisecting the floor, and dynamically changing as they move.",
        "score": 0.175298002704701,
        "scaled_score": 0.175298002704701,
        "id": 1556
    },
    {
        "title": "Speaker Identification of Marine Mammals",
        "url": "-",
        "content": "Speaker Identification of Marine Mammals. Speaker identification techniques (such as a Gaussian Mixture Model (GMM) and a Hidden Markov Model, using cepstral coefficients as features) have been applied to determine the question of whether individual marine mammals can be identified by their vocalizations alone. With a dataset of four killer whales uttering sounds previously classified as belonging to call type n2, and over 10 sounds from each individual, we have found a very high success rate of 80 to 100% correct for the six pairwise comparisons and around 78% correct for identification among all four individuals. The ability to identify marine mammals from their vocalizations alone, in addition to the theoretical interest for production mechanisms, is extremely valuable in the ability to track these mammals from remote locations where visual information is not present.",
        "score": 0.716391160212091,
        "scaled_score": 0.716391160212091,
        "id": 1564
    },
    {
        "title": "RetroCam",
        "url": "http://www.truonex.com/projects/1689",
        "content": "RetroCam. RetroCam caters to all those moments when parents exclaim “Quick! Where’s the camera?”. A beautiful, ambient device, the RetroCam sits quietly in whichever household context you are most likely to miss one of those magic moments.",
        "score": 0.0100000000036152,
        "scaled_score": 0.0100000000036152,
        "id": 1595
    },
    {
        "title": "Hyperscore",
        "url": "http://www.truonex.com/projects/1444",
        "content": "Hyperscore. Hyperscore is an application to introduce children and non-musicians to musical composition and creativity in an intuitive and dynamic way. The \"narrative\" of a composition is expressed as a line-gesture, and the texture and shape of this line are analyzed to derive a pattern of tension-release, simplicity-complexity, and variable harmonization. The child creates or selects individual musical fragments in the form of chords or melodic motives, and layers them onto the narrative-line with e",
        "score": 0.351548089737311,
        "scaled_score": 0.351548089737311,
        "id": 1608
    },
    {
        "title": "Looking Around Corners",
        "url": "http://www.truonex.com/projects/1447",
        "content": "Looking Around Corners. Using a femtosecond laser and a camera with a time resolution of about one trillion frames per second, we can capture movies of light as it moves through a scene, gets trapped inside a tomato, or bounces off the surfaces in a bottle of water. We use this ability to see the time of flight and to reconstruct images of objects that our camera can not see directly (i.e., to look around the corner).",
        "score": 0.121158390787027,
        "scaled_score": 0.121158390787027,
        "id": 1611
    },
    {
        "title": "AlphaWolf",
        "url": "http://www.media.mit.edu/~badger/alphaWolf.html",
        "content": "AlphaWolf. AlphaWolf presents a synthetic wolf pack comprised of autonomous and semi-autonomous wolves who interact with each other much as real wolves do: forming dynamic social relationships based on their past experience. Several people can interact with this installation at the same time. Each participant affects the emotional state of her given wolf by howling, growling, or whimpering into a microphone. In addition, participants may encourage their wolves to interact with specific other wolves. The dynamics of how the wolves interact is determined by the wolves' internal state, their social position in the pack, and their previous experiences with their pack-mates. By letting participants \"get inside the mind and body\" of a wolf, we hope to give them a compelling opportunity to explore the meaning of social behavior. The installation features a suite of supporting technology, including evocative real-time computer graphics, autonomous cinematography, and dynamic scoring and sound design.",
        "score": 0.0970051213615856,
        "scaled_score": 0.0970051213615856,
        "id": 1618
    },
    {
        "title": "Development E-commerce",
        "url": "-",
        "content": "Development E-commerce. We are developing technologies and community methodologies in electronic commerce for social and economic development. We study e-commerce technologies and systems software that are appropriate and appropriable by the majority of the world. Research and development activities integrate with activist field projects that are community-centered. We are keenly interested in first-class technologies that are cost-appropriate for people who make less than two dollars a day.",
        "score": 0.205520336738051,
        "scaled_score": 0.205520336738051,
        "id": 1624
    },
    {
        "title": "Eye-aRe",
        "url": "http://cac.media.mit.edu/eyeare.htm",
        "content": "Eye-aRe. Eye-aRe is a system designed to detect and communicate the intentional information conveyed in eye movement. This glasses-mounted, wireless device stores and transfers information based on users' eye motion and external IR devices, thus promoting an enriched experience with their environment. This project describes how the system measures eye motion and utilizes this as an implicit input channel to a sensor system and computer. In the primary scenario, eye motion detection is used to recognize a user's gaze. When the user’s eyes are fixed, the system infers that he is paying attention to something in his environment and then tries to facilitate an exchange of information in either direction on his behalf.",
        "score": 0.198424334743129,
        "scaled_score": 0.198424334743129,
        "id": 1627
    },
    {
        "title": "Sensetable",
        "url": "http://www.truonex.com/projects/2246",
        "content": "Sensetable. SensetableJames Patten, Gian Antonio Pangaro, Matt Reynolds, Jason Alonso, Joseph Panganiban, Jim Hines, and Professor Hiroshi Ishii / 2002",
        "score": 0.04,
        "scaled_score": 0.04,
        "id": 1635
    },
    {
        "title": "SandScape",
        "url": "http://www.truonex.com/projects/2244",
        "content": "SandScape. SandScape is a tangible interface for designing and understanding landscapes through a variety of computational simulations using sand. Users view these simulations as they are projected on the surface of a sand model that represents the terrain. The users can choose from a variety of different simulations that highlight either the height, slope, contours, shadows, drainage or aspect of the landscape model.",
        "score": 0.107876702500326,
        "scaled_score": 0.107876702500326,
        "id": 1637
    },
    {
        "title": "Boids",
        "url": "http://www.truonex.com/projects/2085",
        "content": "Boids. Classic implementation of flocking boids done as my \"getting started with Unity3D\" exercise.",
        "score": 0.0133333333335018,
        "scaled_score": 0.0133333333335018,
        "id": 1640
    },
    {
        "title": "Bla Bla",
        "url": "http://www.truonex.com/projects/2083",
        "content": "Bla Bla. Short flash animation released at TRSAC’09 demoscene party in Aarhus / DK. It was part of Real Wild demo competition.",
        "score": 0.0100000000036578,
        "scaled_score": 0.0100000000036578,
        "id": 1644
    },
    {
        "title": "Euclase",
        "url": "http://www.truonex.com/projects/2339",
        "content": "Euclase. The Euclase project is exploring who interaction designers are, what types of work they do, and how they think about and express ideas about interactivity. The ultimate goal is to design new programming languages and environments that are more suitable for this kind of design work than any of today's interactive prototyping tools like Adobe Flash or Visual Basic.",
        "score": 0.146597484354894,
        "scaled_score": 0.146597484354894,
        "id": 1654
    },
    {
        "title": "Barista",
        "url": "http://www.truonex.com/projects/2336",
        "content": "Barista. Barista is a new implementation framework, implemented in Citrus, which enables the creation of a new class of highly visual, highly interactive code editors. Editors built with Barista can offer standard features such as conventional text-editing interaction techniques, immediate feedback about errors and code-completion menus. However, Barista editors can also support drag and drop interaction techniques, new types of embedded tools, and alternative views of code.",
        "score": 0.292069597413467,
        "scaled_score": 0.292069597413467,
        "id": 1657
    },
    {
        "title": "Coco",
        "url": "http://gig.media.mit.edu/projects/coco/",
        "content": "Coco. Coco is an alternative applications development system for PDAs based on PalmOS and PocketPC. Using Coco's development environment on a desktop machine, users will be able to write programs in a specialized Logo language and download them to run on PDAs. The goal is to increase the range of people who can develop solutions for PDAs, including standard PalmOS and PocketPC applications such as Calendar or games such as Ms. Pacman. In particular, we plan to enable PDALogo communication with the serial port, thereby allowing integration with the Tower prototyping system.",
        "score": 0.12016275982497,
        "scaled_score": 0.12016275982497,
        "id": 1688
    },
    {
        "title": "E15:oGFx",
        "url": "http://plw.media.mit.edu/people/buza/ogfx.php",
        "content": "E15:oGFx. E15:oGFx is a dynamic openGL texture engine. It provides an interface to a dynamic procedural texture generation context that can be modified at runtime. Using Python as the scripting language, E15:oGFx can be used for procedural animations and data visualizations. One goal of E15:oGFx is to increase the level of end user engagement with existing programs and foster additional creativity on top of scripts written by others within the E15 community. In contrast to traditional 2D graphics environments, E15:oGFx leverages openGL to reveal more than the standard 2D view of the script execution. In particular, the 2D canvas can be scaled in vector graphics sense, and the history of the script execution can be visualized. In addition to many graphics environments, E15:oGFx also supports dynamic loading of GLSL-based shaders, as well as procedural manipulation of shader parameters.",
        "score": 0.0830357459820813,
        "scaled_score": 0.0830357459820813,
        "id": 1714
    },
    {
        "title": "Frame It",
        "url": "http://www.truonex.com/projects/1303",
        "content": "Frame It. Frame It is an interactive, blended, tangible-digital puzzle game intended as a play-centered teaching and therapeutic tool. Current work is focused on the development of a social-signals puzzle game for children with autism that will help them recognize social-emotional cues from information surrounding the eyes. In addition, we are investigating if this play-centered therapy results in the children becoming less averse to direct eye contact with others. The study uses eye-tracking techno",
        "score": 0.259304612644613,
        "scaled_score": 0.259304612644613,
        "id": 1716
    },
    {
        "title": "TV, Rewired!",
        "url": "http://viral.media.mit.edu",
        "content": "TV, Rewired!. Bringing broadcast to the Internet redefines it to a participatory medium. Centralized distribution does not scale for technical and economic reasons; instead, we distribute distribution to the receivers. We do this with Rewire, a dynamic protocol with a completely distributed architecture that has evolved from the VidTorrent project. The protocol builds an elastic, self-healing overlay that scales organically, with no upfront investment. Latency and effects on the network are minimized with gradual self-optimization.",
        "score": 0.252706786277872,
        "scaled_score": 0.252706786277872,
        "id": 1718
    },
    {
        "title": "Merry Miser",
        "url": "http://www.truonex.com/projects/1304",
        "content": "Merry Miser. Merry Miser is a mobile application which persuades people to spend less money, and think more about their spending. By combining users' real financial transaction information, their location, and personal assessments of spending, the application presents deeply personalized and compelling interventions at the time and place when they are near an opportunity to shop. The interventions help to reinforce choices that are in the users' better long-term self interest, against short-term impuls",
        "score": 0.194983220581937,
        "scaled_score": 0.194983220581937,
        "id": 1723
    },
    {
        "title": "Deep Walls",
        "url": "http://www.truonex.com/projects/2535",
        "content": "Deep Walls. Deep Walls is a projected cabinet of cinematic memories. When a person walks into its projection beam, the interactive wall starts recording his shadow, and the shadows of those who follow. When the last person leaves the frame, the shadows replay within one of sixteen small rectangular cupboards, looping indefinitely. Like structuralist films, the collection of repetitive videos becomes an object unto-itself, rather than strictly representational “movie.”Deep Walls creates a complex temporal re",
        "score": 0.234794086262411,
        "scaled_score": 0.234794086262411,
        "id": 1740
    },
    {
        "title": "Concentration",
        "url": "http://www.truonex.com/projects/2534",
        "content": "Concentration. From the Screen SeriesUntouched, Concentration is a pristine rectangle of white light. When a first person walks into the field of its projected screen, the screen’s light immediately collapses and brightens around her shadow, and no one else’s. Only when viewers touch does light expands from one person to another, creating a flickering aura, reminiscent of a light bulb with a loose electrical connection. It is possible to transfer the glow from one person to another, but only by reaching deep w",
        "score": 0.252347747714023,
        "scaled_score": 0.252347747714023,
        "id": 1741
    },
    {
        "title": "Depletion",
        "url": "http://www.truonex.com/projects/2536",
        "content": "Depletion. From the Screen SeriesDepletion allows viewers to create \"motion paintings\" through full-body gestures on its subtractive canvas in a manner similar to the techniques of abstract expressionist. Depletion can also be seen as a virtual screen with a fixed quantity of energy. As bodies enter its bright projected field, their shadows eat away at the projected light itself. Wherever people move, they consume the projected light. The work means to highlight the frailty of immaterial projection: film f",
        "score": 0.476706445566652,
        "scaled_score": 0.476706445566652,
        "id": 1743
    },
    {
        "title": "Central Mosaic",
        "url": "http://www.truonex.com/projects/2530",
        "content": "Central Mosaic. Central Mosaic, part of the mosaic series, records the shadows of people as they walk in front of a projection screen and replays them in silhouette. The recordings move out towards the edges and become smaller as new recordings take their place. The structure of the work is like a fractal, with detail being pushed out towards the leaves in a self-similar form. The work \"ticks\" like a clock, with older material first proceeding clockwise around the central large recording, and then filtering out",
        "score": 0.741107849083757,
        "scaled_score": 0.741107849083757,
        "id": 1745
    },
    {
        "title": "Circular Breathing",
        "url": "http://www.truonex.com/projects/2532",
        "content": "Circular Breathing. Circular Breathing is a personal breath recorder. While breathing and blowing into the mouthpiece, the viewer records a breath pattern. After letting go of the button, the breath pattern plays back indefinitely, looping from start to finish. The piece turns the circular process of breathing into a circular recording. With practice, viewers can create seamless air loops that mimic the break beat loops of hip-hop composition. The “synthetic” breath recordings give the fan a lifelike quality, chall",
        "score": 0.100723440607793,
        "scaled_score": 0.100723440607793,
        "id": 1747
    },
    {
        "title": "Shield Field Imaging",
        "url": "-",
        "content": "Shield Field Imaging. We present a new method for scanning 3D objects in a single shot, shadow-based method. We decouple 3D occluders from 4D illumination using shield fields: the 4D attenuation function which acts on any light field incident on an occluder. We then analyze occluder reconstruction from cast shadows, leading to a single-shot light field camera for visual hull reconstruction.",
        "score": 0.564698725770476,
        "scaled_score": 0.564698725770476,
        "id": 1751
    },
    {
        "title": "twithinks",
        "url": "http://www.truonex.com/projects/2657",
        "content": "twithinks. We monitor the 2012 Presidential election on Twitter. Currently, we measure how many times each candidate is mentioned on each day in each state and what topics are frequently mentioned. Tweets are filtered based on their users and the presence of certain keywords. We follow approximately ten million active American Twitter users. These users are filtered based on their locations and connections. Thus we could remove most irrelevant tweets from spam-bots or foreign countries. A large set of keywords is used to track election-related tweets, and as of Oct 9th, there are over 50 million tweets since Jan 1st, 2012. Of course, with such amount of data, there are a lot more analyses that could be done. Suggestions are most welcome. http://twitwi.mit.edu",
        "score": 0.274442414035613,
        "scaled_score": 0.274442414035613,
        "id": 1767
    },
    {
        "title": "Infinity-by-Nine",
        "url": "http://obm.media.mit.edu",
        "content": "Infinity-by-Nine. We expand the home-video viewing experience by generating imagery to extend the TV screen and give the impression that the scene wraps completely around the viewer. Optical flow, color analysis, and heuristics extrapolate beyond the screen edge, where projectors provide the viewer's perceptual vision with low-detail dynamic patterns that are perceptually consistent with the video imagery and increase the sense of immersive presence and participation. We perform this processing in real time using standard microprocessors and GPUs.",
        "score": 0.261293108021305,
        "scaled_score": 0.261293108021305,
        "id": 1771
    },
    {
        "title": "The Droplet",
        "url": "http://www.truonex.com/projects/1691",
        "content": "The Droplet. The Droplet is a glucose monitor for people who have recently been diagnosed with diabetes and are in the process of learning how to manage their disease, their symptoms, and their lifestyle.",
        "score": 0.184536039612046,
        "scaled_score": 0.184536039612046,
        "id": 1778
    },
    {
        "title": "smartCharge",
        "url": "-",
        "content": "smartCharge. With the next generation of lightweight electric vehicles being deployed in vehicle sharing systems across the world, there is a growing need for smarter charging infrastructure. smartCharge is the next generation of intelligent charging infrastructure for EVs in cities. Specifically optimized for EV sharing systems, the smartCharge platform integrates secure locking, high current vehicle charging (up to 36A), and data transfer into a single connector. Its concentric connector design allows users to insert the plug from any angle, allowing them to quickly lock and charge the rented vehicle without wasting time and space with separate docking and charging systems. The system connects vehicles to a smart charging post that integrates ambient LED lighting to provide feedback to users on the current state of charge of the vehicle, its availability status, and maintenance needs. The connection system is universally designed to function with electric bicycles, scooters, cars, and other lightweight EVs.",
        "score": 0.0857123583908357,
        "scaled_score": 0.0857123583908357,
        "id": 1790
    },
    {
        "title": "Intelligent Autonomous Parking Environment",
        "url": "-",
        "content": "Intelligent Autonomous Parking Environment. In an urban environment, space is a valuable commodity. Current parking structures must allow each driver to independently navigate the parking structure to find a space. As next-generation vehicles turn more and more to drive-by-wire systems, though, direct human interaction will not be necessary for vehicle movement. An intelligent parking environment can use drive-by-wire technology to take the burden of parking away from the driver, allowing for more efficient allocation of parking resources to make urban parking less expensive. With central vehicle control, cars can block each other while parked since the parking environment can move other vehicles to enabled a blocked vehicle to leave. The parking environment can also monitor the vehicle charge, allowing intelligent and efficient utilization of charge stations by moving vehicles to and from charge stations as necessary.",
        "score": 0.149413088540622,
        "scaled_score": 0.149413088540622,
        "id": 1811
    },
    {
        "title": "Jasper",
        "url": "http://www.truonex.com/projects/2342",
        "content": "Jasper. Jasper is an Eclipse plug-in that allows you to gather three types of information into a single document: references to code snippets, textual notes, and links to parts of web pages. In doing so, Jasper allows you to keep track of your development tasks in a clean and distinct fashion, much like bug reports are a central source for information about a particular bug. These documents can then be stored for later and shared with colleagues, perhaps by attaching them to bug reports to document the",
        "score": 0.308207820477321,
        "scaled_score": 0.308207820477321,
        "id": 1824
    },
    {
        "title": "Miniature Video Projector (Personal Projection)",
        "url": "http://www.media.mit.edu/~vmb/obmg.html",
        "content": "Miniature Video Projector (Personal Projection). Linear arrays of surface-emitting semiconductor lasers provide the basis for very small, low-power video projectors requiring minimal optics. Such projectors are suitable for handheld devices like phones.",
        "score": 0.159383264311516,
        "scaled_score": 0.159383264311516,
        "id": 1839
    },
    {
        "title": "CryBaby",
        "url": "-",
        "content": "CryBaby. The cry detector running on the iPAQ under Linux is an implementation of the baby monitor, one of the applications announced in the Impromptu project. Unlike the other Impromptu applications, the baby monitor doesn't need the bandwidth for sound transmission all the time. It opens a bi-directional audio channel only when the baby starts crying. One can think of detecting different types of interesting sound patterns. In many cases, the detection requires few computational resources. Simple sound-pattern detectors of this kind are highly scalable and can be used in a variety of applications.",
        "score": 0.96571428570314,
        "scaled_score": 0.96571428570314,
        "id": 1842
    },
    {
        "title": "Style Wars",
        "url": "http://www.truonex.com/projects/1870",
        "content": "Style Wars. Style Wars is a two-player game that tests the player’s reaction and speed. The game is simple and only consists of a game unit with an integrated camera, speakers and a score-keeping system.",
        "score": 0.912727272566925,
        "scaled_score": 0.912727272566925,
        "id": 1855
    },
    {
        "title": "Psychology of Money",
        "url": "-",
        "content": "Psychology of Money. Money is a wonderful invention. It lets people specialize, save, and trade. At the same time, money is very abstract, making it very hard to think about the \"shadow value\" of money (all other possible uses for money). In this project, we are investigating the ways in which individuals think about money, and in particular about the ways in which the psychology of money deviates from standard utility.",
        "score": 0.173353871206991,
        "scaled_score": 0.173353871206991,
        "id": 1867
    },
    {
        "title": "eRationality",
        "url": "http://erationality.media.mit.edu",
        "content": "eRationality. In the eRationality group we study how people behave and make day-to-day decisions, particularly in electronic environments. We investigate rationality, semi rationality, bounded rationality, and just plain irrationality. We wish to build tools that reformulate the options available to people so that they can maximize their own happiness.",
        "score": 0.218337865395261,
        "scaled_score": 0.218337865395261,
        "id": 1870
    },
    {
        "title": "Directrix",
        "url": "http://www.truonex.com/projects/2435",
        "content": "Directrix. Directrix (1998: Golan Levin) is an interactive drawing environment in which users can quickly generate animated \"pseudo-parabolas.\" These complex curves are the result of an interplay between a set of dynamic and static gestures performed by the user. When several of these curves are layered together, the results can vary from sparse and delicate constructions of gently curved lines, to violently twitching, thatchy masses.",
        "score": 0.441732923540103,
        "scaled_score": 0.441732923540103,
        "id": 1883
    },
    {
        "title": "The Dumpster",
        "url": "http://www.truonex.com/projects/2436",
        "content": "The Dumpster. The Dumpster (2006: Golan Levin, Kamal Nigam and Jonathan Feinberg) is an interactive online visualization that attempts to depict a slice through the romantic lives of American teenagers. Using real postings extracted from millions of online blogs, visitors to the project can surf through tens of thousands of specific romantic relationships in which one person has \"dumped\" another. The project's graphical tools reveal the astonishing similarities, unique differences, and underlying patterns of",
        "score": 0.103043250869457,
        "scaled_score": 0.103043250869457,
        "id": 1884
    },
    {
        "title": "Eyeshine",
        "url": "http://www.truonex.com/projects/2438",
        "content": "Eyeshine. Eyeshine (2011, Golan Levin and Kyle McDonald) is an interactive installation which captures, records and replays the retroreflections (red-eye effects) from the eyes of its observers. In doing so it presents an image wholly constructed through the process of being observed.",
        "score": 0.439711620231689,
        "scaled_score": 0.439711620231689,
        "id": 1891
    },
    {
        "title": "Finger Spies",
        "url": "http://www.truonex.com/projects/2439",
        "content": "Finger Spies. In early 2004 I was invited to create a new work for an exhibition at an art foundation in Holland. The subject of the exhibition was humor. I decided to depart from the field of new-media experiments, while remaining in the 'digital' realm, by having some fun with the great Dutch Masters — Rembrandt, Vermeer, and Van Eyck. My partner Andrea made all of the costumes and spent a long time crouched underneath a cardboard box while I carefully positioned and photographed her fingers. It was a new e",
        "score": 0.135561859627258,
        "scaled_score": 0.135561859627258,
        "id": 1892
    },
    {
        "title": "3DprintedClock",
        "url": "-",
        "content": "3DprintedClock. The 3DprintedClock project is the result of ready-assembled 3D printed computational mechanisms, and is related to research in the fields of rapid prototyping and digital fabrication. The clock was modeled in CAD software after an existing clock, and uses a weight and a pendulum to keep track of time. The CAD model was created according to the specifications of the 3D printer, assuring sufficient gaps and clearances for the different parts. In addition, support material, drainage, and perforations were added to allow for excess support material being removed after printing. The 3DprintedClock is intended to demonstrate the superior capabilities of 3D printing as a fabrication process. It should contribute toward the future use of 3D printers to replace injection molding and expensive tooling processes, and allow for on demand, customized, and “greener” consumer products.",
        "score": 0.1416073691207,
        "scaled_score": 0.1416073691207,
        "id": 1894
    },
    {
        "title": "Puzzlaef",
        "url": "-",
        "content": "Puzzlaef. How can one understand and visualize the lifestyle of a person on the other side of the world? Puzzlaef attempts to tackle this question through a mobile picture puzzle game where users collaboratively solve with pictures from their lifestyles.",
        "score": 0.417237548841092,
        "scaled_score": 0.417237548841092,
        "id": 1901
    },
    {
        "title": "Sound Sign",
        "url": "http://www.truonex.com/projects/1514",
        "content": "Sound Sign. Questioning the elements of identity that people create for themselves – clothing, signatures – or that they already have – like fingerprints, iris, DNA – the aim of this project was to visualise the uniqueness of peoples voices in combination with the very first thing they identify themselves with, their names.",
        "score": 0.249563213775995,
        "scaled_score": 0.249563213775995,
        "id": 1921
    },
    {
        "title": "Rhythm in my Veins",
        "url": "http://www.truonex.com/projects/1513",
        "content": "Rhythm in my Veins. In a retaliation against the confines of code writing (this being the fixed position in front of the computer screen), I wanted to encourage physical interaction to create my data by tracking movement whilst dancing. The poster features several abstract representations of the movement to selected songs.",
        "score": 0.783386804959377,
        "scaled_score": 0.783386804959377,
        "id": 1924
    },
    {
        "title": "Connectibles",
        "url": "http://web.media.mit.edu/~jeevan/pages/connectibles.html",
        "content": "Connectibles. Connectibles are small \"keepsake\" objects that are exchanged by individuals, establishing a communication portal between them. As an ecology of objects, the Connectibles system physically embodies a social network; as an ecology of \"smart\" objects, it can automatically build rich representations of social networks. Any gift from one person to another contains information about the relationship between the giver and the receiver, but this information remains locked away in each object. If we could capture this information, we might expose social networks that have both more detail and greater consonance with a user's \"reality-based\" social network than current virtual, Internet-based social network applications. We might also open up a new, tangible way to interact with social networks, using as phicons the very same sentimental objects that represent people in the user's social network.",
        "score": 0.0966390642125519,
        "scaled_score": 0.0966390642125519,
        "id": 1942
    },
    {
        "title": "Bishop: Understanding Complex Spatial Language",
        "url": "http://www.media.mit.edu/cogmac/projects.html",
        "content": "Bishop: Understanding Complex Spatial Language. The Bishop project explores the subtleties of human language when talking about spatial scenes. In particular, we investigate the various descriptive strategies human speakers employ in talking about objects in relation to other objects. These strategies include ordering objects, visually grouping them, describing their spatial relation or even referring back to objects that used to be in the scene. Furthermore, human subjects frequently perform combinations of these strategies, for example \"the green one to the left of the three purple ones.\" We are building a computational system that replicates both the individual phenomena and their compositional behavior. As a result, this system understands relatively complex expressions referring to a scene of objects and can indicate the object being described. This work has direct applications for understanding for natural-language user interfaces, especially in augmenting direct-manipulation interfaces with intelligent speech control. A good example is speech interfaces for GPS map devices in cars where users speak about objects on the map.",
        "score": 0.220945226575002,
        "scaled_score": 0.220945226575002,
        "id": 1946
    },
    {
        "title": "CATRA: Mapping of Cataract Opacities Through an Interactive Approach",
        "url": "http://www.truonex.com/projects/1425",
        "content": "CATRA: Mapping of Cataract Opacities Through an Interactive Approach. We introduce a novel interactive method to assess cataracts in the human eye by crafting an optical solution that measures the perceptual impact of forward scattering on the foveal region. Current solutions rely on highly trained clinicians to check the back scattering in the crystallin lens and test their predictions on visual acuity tests. Close-range parallax barriers create collimated beams of light to scan through sub-apertures scattering light as it strikes a cataract. User feedback genera",
        "score": 0.166972192721821,
        "scaled_score": 0.166972192721821,
        "id": 1963
    },
    {
        "title": "Genomic Cartography",
        "url": "http://acg.media.mit.edu/people/fry",
        "content": "Genomic Cartography. This research is about finding ways to understand dynamic sources of information. Network usage patterns and computational processes are being explored through representations that focus on extracting the qualitative features from these very large data sets. The current focus of this work is in genomics and bioinformatics. In addition to the standard computer screen, alternative display devices are being studied, including handheld computers and large format printing.",
        "score": 0.283313728002502,
        "scaled_score": 0.283313728002502,
        "id": 1970
    },
    {
        "title": "Software Perception",
        "url": "http://acg.media.mit.edu/people/tom/",
        "content": "Software Perception. The purpose of the Software Perception project is to develop fluid knowledge representations for the concepts needed to understand and create programs. These representations will power a visual editor to assist a person synthesizing new code through a visual dialogue. The system utilizes simulations to build models of many existing real-world metaphors used for programming models. In the other direction, visualization involves creating real-world analogues to abstract processes. The goal is to teach the system programming concepts and concepts based on real-world experiences, and the relation between the two.",
        "score": 0.207238072449988,
        "scaled_score": 0.207238072449988,
        "id": 1971
    },
    {
        "title": "Gradr",
        "url": "http://www.truonex.com/projects/1735",
        "content": "Gradr. Gradr is an iPhone app that lets users log their grades and keep track of their school progress with simple visualizations. Users can see how an upcoming evaluation will influence their subject average.",
        "score": 0.127501700017194,
        "scaled_score": 0.127501700017194,
        "id": 1981
    },
    {
        "title": "Pumpartnr",
        "url": "http://www.truonex.com/projects/1738",
        "content": "Pumpartnr. Pumpartnr is an iOS app that helps athletes plan, track, and reflect on their strength training progress without the fuss.",
        "score": 0.144615093284939,
        "scaled_score": 0.144615093284939,
        "id": 1987
    },
    {
        "title": "Data-Driven Elevator Music",
        "url": "-",
        "content": "Data-Driven Elevator Music. Our new building lets us see across spaces, extending our visual perception beyond the walls that enclose us. Yet, invisibly, networks of sensors, from HVAC and lighting systems to Twitter and RFID, control our environment and capture our social dynamics. This project proposes extending our senses into this world of information, imagining the building as glass in every sense. Sensor devices distributed throughout the Lab transmit privacy-protected audio streams and real-time measurements of motion, temperature, humidity, and light levels. The data are composed into an eight-channel audio installation in the glass elevator that turns these dynamic parameters into music, while microphone streams are spatialized to simulate their real locations in the building. A pressure sensor in the elevator provides us with fine-grained altitude to control the spatialization and sonification. As visitors move from floor to floor, they hear the activities taking place on each.",
        "score": 0.065300566894387,
        "scaled_score": 0.065300566894387,
        "id": 1990
    },
    {
        "title": "Programmable Beads",
        "url": "-",
        "content": "Programmable Beads. As part of the Toys to Think With project, we built several strings of Programmable Beads: computational jewelry that children (of all ages) can play with and learn from. Each bead is a tiny computer, able to talk to its neighbors and to change color. The Programmable Beads were an attempt to extend classic bead play activity to include exploration of dynamic patterns and we hoped that Programmable Beads, like the non-programmable kind, would be particularly attractive to girls, as girls as a group have usually been under-served by developers of technology.",
        "score": 0.168703622244336,
        "scaled_score": 0.168703622244336,
        "id": 2006
    },
    {
        "title": "Smart DC MicroGrid",
        "url": "-",
        "content": "Smart DC MicroGrid. Given the increasing development of renewable energy, its integration into the electric distribution grid needs to be addressed. In addition, the majority of household appliances operate on DC. The aim of this project is to develop a microgrid capable of addressing these issues, while drawing on a smart control system.",
        "score": 0.21375829163449,
        "scaled_score": 0.21375829163449,
        "id": 2051
    },
    {
        "title": "A Dipole Field for Object Delivery by Pushing on a Flat Surface",
        "url": "http://www.truonex.com/projects/2420",
        "content": "A Dipole Field for Object Delivery by Pushing on a Flat Surface. We introduce a simple algorithm for non-prehensile object transportation by a pushing robot on a flat surface. We assume that the global position and orientation of the robot and objects are known. The system computes a dipole field around the object and moves the robot along the field. This simple algorithm resolves many subtle issues in implementing reliable pushing behaviors, such as collision avoidance, error recovery, and multi-robot coordination. We verify the effectiveness of the algorith",
        "score": 0.335215513222464,
        "scaled_score": 0.335215513222464,
        "id": 2055
    },
    {
        "title": "Alphabet Synthesis Machine",
        "url": "http://www.truonex.com/projects/2426",
        "content": "Alphabet Synthesis Machine. Alphabet Synthesis Machine (2001: Golan Levin, Jonathan Feinberg and Cassidy Curtis) is an interactive online artwork, commissioned by PBS and Art21.org, which allows one to create and evolve the possible writing systems of one’s own imaginary civilizations. The abstract alphabets produced with the software can be downloaded as TrueType fonts, and are entered into a comprehensive archive of user creations. The products of the Alphabet Synthesis Machine probe the liminal territories between famil",
        "score": 0.272637211034253,
        "scaled_score": 0.272637211034253,
        "id": 2057
    },
    {
        "title": "Scratch for Computer Science",
        "url": "-",
        "content": "Scratch for Computer Science. Although we designed Scratch primarily as a means for personal expression, a growing number of high schools and colleges (including Harvard and Berkeley) are using Scratch as an introduction to computer science and programming. The Scratch4CS project explores the question: \"Can we extend Scratch so that it is suitable for a full-semester introduction to programming and computational thinking?\" This question is particularly relevant now since there are several initiatives underway to rethink introductory computer science courses and advanced-placement exams.",
        "score": 0.429695918639261,
        "scaled_score": 0.429695918639261,
        "id": 2071
    },
    {
        "title": "Sonic FlashlightTM",
        "url": "http://www.truonex.com/projects/2519",
        "content": "Sonic FlashlightTM. Our objective is to permit in situ visualization of ultrasound images so that direct hand-eye coordination can be employed during invasive procedures. A method is presented that merges the visual outer surface of a patient with a simultaneous ultrasound scan of the patient's interior. The method combines a flat-panel monitor with a half-silvered mirror such that the image on the monitor is reflected precisely at the proper location within the patient. The ultrasound image is superimposed in real",
        "score": 0.794179185734799,
        "scaled_score": 0.794179185734799,
        "id": 2072
    },
    {
        "title": "Fragmented Sounds",
        "url": "http://www.truonex.com/projects/1504",
        "content": "Fragmented Sounds. In music composition, fragmentation is the use of fragments or the division of a musical idea (gesture, motive, theme, etc.) into segments. Fragmented Sounds is about reacquiring and manipulating sound fragments into an unique creation using careful head movements. There are many different layers of interaction for the user to discover, creating an interesting experience both the first and the 100th time.",
        "score": 0.168006713828431,
        "scaled_score": 0.168006713828431,
        "id": 2099
    },
    {
        "title": "CityCar Ingress-Egress Model",
        "url": "http://www.truonex.com/projects/1437",
        "content": "CityCar Ingress-Egress Model. The CityCar Ingress-Egress Model provides a full-scale platform for testing front ingress and egress for new vehicle types. The platform features three levels of actuation for controlling the movement of seats within a folding vehicle, and can store custom presets of seat positioning and folding process for different users.",
        "score": 0.23622002411534,
        "scaled_score": 0.23622002411534,
        "id": 2140
    },
    {
        "title": "Escapism",
        "url": "http://www.truonex.com/projects/2295",
        "content": "Escapism. ** [ An expeirment in spontaneously releasing office workers’ stress while working ] ** The Escapism: a new way of things is a set of joyful sound effect objects around an office workspace which attempt to help office workers obtain a moment of escape from mundane or stressful tasks. Unobtrusive ambient sound would generated by small interactions between office workers’ unconscious behaviours and these objects.",
        "score": 0.360942511745523,
        "scaled_score": 0.360942511745523,
        "id": 2159
    },
    {
        "title": "Actuated Workbench",
        "url": "http://www.truonex.com/projects/2165",
        "content": "Actuated Workbench. The Actuated Workbench is a device that uses magnetic forces to move objects on a table in two dimensions. It is intended for use with existing tabletop tangible interfaces, providing an additional feedback loop for computer output, and helping to resolve inconsistencies that otherwise arise from the computer’s inability to move objects on the table.",
        "score": 0.421970398916298,
        "scaled_score": 0.421970398916298,
        "id": 2186
    },
    {
        "title": "Wait Loss",
        "url": "-",
        "content": "Wait Loss. Tired of waiting for public transportation to arrive? Wait Loss will tell you the expected arrival time of your favorite bus or train so you can be more productive.",
        "score": 0.0100000000004955,
        "scaled_score": 0.0100000000004955,
        "id": 2208
    },
    {
        "title": "Promiserver",
        "url": "http://promise.media.mit.edu/",
        "content": "Promiserver. Promiserver provides toolkits and services for online micro-contracts that are socially constructed, community enforced, and procedurally executed. The project aims to offer a sensible, lightweight, and agile promise system as an alternative to traditionally heavy legal commitments, and to facilitate new models of collaborative business by reducing transaction costs and improving market fluidity.",
        "score": 0.361001941321015,
        "scaled_score": 0.361001941321015,
        "id": 2247
    },
    {
        "title": "Ubiquitous Media Portals",
        "url": "http://www.media.mit.edu/resenv/portals/",
        "content": "Ubiquitous Media Portals. We have turned our building into a living laboratory by distributing 45 Ubiquitous Media Portals throughout our facility. These sensor-rich platforms capture video and stereo audio in addition to measuring nearby motion, temperature/humidity, light levels, and IR detection of active badges. The portals also work as Zigbee base stations, enabling communication and localization of various low-power, wireless, wearable devices that our group and others have developed for on-body sensing and identification/tracking of people. They also feature a small touch-screen display and speaker, allowing them to render and present dynamic graphics and information.",
        "score": 0.267589906668057,
        "scaled_score": 0.267589906668057,
        "id": 2254
    },
    {
        "title": "BitBrush",
        "url": "-",
        "content": "BitBrush. BitBrush is a tool for writing and drawing with bits. It combines the digital versatility of an inkjet printer with the physical expressivity of hand gestures to support new means of expression. In BitBrush, lines are composed of an array of pixels which can be programmed to adapt in real-time to a user’s drawing gestures.",
        "score": 0.537916232672527,
        "scaled_score": 0.537916232672527,
        "id": 2261
    },
    {
        "title": "The Affective Remixer: Personalized Music Arranging",
        "url": "http://courses.media.mit.edu/2005spring/mas630/05.projects/AffectListener/",
        "content": "The Affective Remixer: Personalized Music Arranging. Affective Remixer is a real-time music-arranging system that reacts to immediate affective cues from a listener. Data was collected on the potential of certain musical dimensions to elicit change in a listener’s affective state using sound files created explicitly for the experiment through composition/production, segmentation, and re-assembly of music along these dimensions. Based on listener data, a probabilistic state transition model was developed to infer the listener’s current affective state. A second model was made that would select music segments and re-arrange ('re-mix') them to induce a target affective state.",
        "score": 0.402570297786028,
        "scaled_score": 0.402570297786028,
        "id": 2268
    },
    {
        "title": "Mindful Camera",
        "url": "http://www.media.mit.edu/mf",
        "content": "Mindful Camera. Documentary videography is a practice of observing the real world, recording video of desired events, and organizing the collection for presentation to an audience. Observations and decisions made during capture highly impact the process of documentary creation. The Mindful Camera is designed to support the story-construction goals of the documentary videographer during capture and organization of content collections. The video camera is imbued with rudimentary story-understanding capabilities incited by annotation by the videographer in the moment of capture. The camera uses common-sense knowledge and reasoning to expand metadata of captured video clips, suggest shots to the videographer, and track story patterns in the information track of a video collection. The capture process leverages the videographer’s observations during capture to increase the narrative possibility of his or her video collections.",
        "score": 0.447126496163942,
        "scaled_score": 0.447126496163942,
        "id": 2270
    },
    {
        "title": "Navigating in Very Large Display Spaces",
        "url": "http://lieber.www.media.mit.edu/people/lieber/Lieberary/Macroscope/Macroscope.html",
        "content": "Navigating in Very Large Display Spaces. How would you browse a VERY large display space, such as a street map of the entire world? The traditional solution is zoom and pan, but these operations have drawbacks that have gone unchallenged for decades. Shifting attention loses the wider context, leading to that \"lost in hyperspace\" feeling. We are exploring alternative solutions, such as a new technique that allows zooming and panning in multiple translucent layers.",
        "score": 0.288062876484962,
        "scaled_score": 0.288062876484962,
        "id": 2285
    },
    {
        "title": "FishFace",
        "url": "http://www.truonex.com/projects/2190",
        "content": "FishFace. FishFacePaul Yarin, Joshua Smith (Physics and Media Group), and Professor Hiroshi Ishii / 1998",
        "score": 0.0133333333339603,
        "scaled_score": 0.0133333333339603,
        "id": 2298
    },
    {
        "title": "SoundStrand",
        "url": "http://www.truonex.com/projects/1401",
        "content": "SoundStrand. SoundStrand is a music composition toy. It comprises a set of building blocks, each containing a musical motif. The blocks can be connected to each other to create a musical theme. They can also be manipulated with three degrees of freedom: elongation changes the rhythmic distribution of the notes; bending changes the direction of the melody; and twisting changes the harmonic context.",
        "score": 0.279188685269779,
        "scaled_score": 0.279188685269779,
        "id": 2308
    },
    {
        "title": "Cinemaware",
        "url": "http://web.media.mit.edu/~aisling/research.html",
        "content": "Cinemaware. Cinemaware is a custom-built capture, annotation, editing, and compression tool for preparing video content for integration with multiple display and distribution applications. Implemented in Java, the application provides four modes of operation: live capture, keyword annotation, rudimentary editing, and batch processing. The capture mode provides an interface for capturing video through a USB port, while the annotation mode presents an extensible interface for adding freeform text annotations, time-code associated key-words, and general movie properties such as title, character, location, and time. The annotation schema can be modified to incorporate appropriate input fields depending on the needs of external retrieval and display applications. Captured video clips can be refined using a simple editing interface, and the batch-processing mode enables the export of multiple video, image, or audio files according to a specified compression output.",
        "score": 0.230479012402529,
        "scaled_score": 0.230479012402529,
        "id": 2311
    },
    {
        "title": "Place Pulse",
        "url": "http://www.truonex.com/projects/1409",
        "content": "Place Pulse. Place Pulse is a website that allows anybody to quickly run a crowdsourced study and interactively visualize the results. It works by taking a complex question, such as “Which place in Boston looks the safest?” and breaking it down into easier to answer binary pairs. Internet participants are given two images and asked \"Which place looks safer?\" From the responses, directed graphs are generated and can be mined, allowing the experimenter to identify interesting patterns in the data and form new",
        "score": 0.663504623129887,
        "scaled_score": 0.663504623129887,
        "id": 2313
    },
    {
        "title": "Sensate Roadbeds",
        "url": "http://www.media.mit.edu/resenv/roadpak.html",
        "content": "Sensate Roadbeds. We are building a prototype infrastructure for real-time collection and distribution of comprehensive information about road traffic and conditions on a network of streets. Small (2 cm diameter) cylinders placed just under the road surface count passing vehicles by detecting magnetic-field disturbances. Periodically, these sensors transmit an updated count by radio to a regional repeater, which relays them to a central processing station. Each package, which costs about $40, is powered by a single lithium battery, and can be installed in a few minutes without tearing up the road. The central station uses the sensor data to compute queue-length and departure-rate statistics for each road segment, and uses Little's Formula to assign a time in seconds to each road link. This database is published once a minute on the Internet. Vehicles will use CDPD or a similar wireless network standard to download the relevant sections of the database, and plan optimum (shortest-time or least-fuel) routes through the road network, informing the driver of suggested route changes in real time. We will also explore adding other minimally expensive sensors to this package, such as piezo pickups for detecting road vibration, and perhaps accident signatures and temperature and humidity sensors to determine local road conditions.",
        "score": 0.212932059776107,
        "scaled_score": 0.212932059776107,
        "id": 2318
    },
    {
        "title": "Noise Locked Loop",
        "url": "http://www.media.mit.edu/~vigoda",
        "content": "Noise Locked Loop. We are building a nonlinear dynamic system that constitutes a new kind of phase-locked loop. This Noise Locked Loop (NLL) will entrain with an incoming pseudo-random bit stream generated by a matched LFSR, instead of simple sinusoidal signals. The hope is that this will be a cheap and very effective front-end for spread-spectrum receivers, allowing spread-spectrum to be deployed for new applications. For example, one could potentially use spread-spectrum clock distribution on large chips. In the process, we have begun to understand how to compute using nonlinear dynamic systems.",
        "score": 0.280725354098842,
        "scaled_score": 0.280725354098842,
        "id": 2321
    },
    {
        "title": "me, doing this.",
        "url": "http://www.truonex.com/projects/1713",
        "content": "me, doing this.. me, doing this. is a programme built in Max/MSP that visualizes myself programming this programme to visualize myself programming… Yip, coding inception.",
        "score": 0.0133333333350051,
        "scaled_score": 0.0133333333350051,
        "id": 2343
    },
    {
        "title": "silenc",
        "url": "http://www.truonex.com/projects/1715",
        "content": "silenc. silenc is a tangible visualization of an interpretation of silent letters within Danish, English and French.",
        "score": 0.759999999968963,
        "scaled_score": 0.759999999968963,
        "id": 2345
    },
    {
        "title": "Irish College Exhibits: Louvain Institute",
        "url": "http://www.truonex.com/projects/2372",
        "content": "Irish College Exhibits: Louvain Institute. The Irish Colleges scattered around mainland Europe were set up to educate Catholics from Ireland in their own religion following the takeover of the country by the Protestant English state in the Tudor re-conquest of Ireland.",
        "score": 0.0100000000011418,
        "scaled_score": 0.0100000000011418,
        "id": 2355
    },
    {
        "title": "Total Scene Understanding",
        "url": "http://www.truonex.com/projects/1884",
        "content": "Total Scene Understanding. Given an image, we propose a hierarchical generative model that classifies the overall scene, recognizes and segments each object component, as well as annotates the image with a list of tags. To our knowledge, this is the first model that performs all three tasks in one coherent framework. For instance, a scene of a ‘polo game’ consists of several visual objects such as ‘human’, ‘horse’, ‘grass’, etc. In addition, it can be further annotated with a list of more abstract (e.g. ‘dusk’) or visuall",
        "score": 0.903393022088432,
        "scaled_score": 0.903393022088432,
        "id": 2413
    },
    {
        "title": "Affective Mirror",
        "url": "-",
        "content": "Affective Mirror. The Affective Mirror is an attempt to build a fully automated system that intelligently responds to a person's affective state in real time. Current work is focused on building an agent that realistically mirrors a person's facial expression and posture. The agent detects affective cues through a facial-feature tracker and a posture-recognition system developed in the Affective Computing group; based on what affect a person is displaying, such as interest, boredom, frustration, or confusion, the system responds with matching facial affect and/or posture. This project is designed to be integrated into the Learning Companion Project, as part of an early phase of showing rapport-building behaviors between the computer agent and the human learner.",
        "score": 0.156105937374628,
        "scaled_score": 0.156105937374628,
        "id": 2422
    },
    {
        "title": "RunLog",
        "url": "http://runlog.media.mit.edu/",
        "content": "RunLog. RunLog is a simple Web application that keeps track of how much a user runs. For frequent runners, RunLog can be a useful tool to keep track of running goals. But RunLog was built to motivate people who spend most of their day working in front of a computer. Many people start running to get in shape as a New Year's resolution, and hopefully RunLog will help users maintain goals through the support of an online social network.",
        "score": 0.417544518501949,
        "scaled_score": 0.417544518501949,
        "id": 2449
    },
    {
        "title": "NetScratch",
        "url": "http://web.media.mit.edu/~tstern/netscratch/index.html",
        "content": "NetScratch. We are extending our Scratch programming language to interact across networks. This extension will enable kids to bring information and artifacts from the Web and from other users' projects into their own Scratch projects. In designing interactive networked projects, kids are able to think about how their individual ideas and creations can connect to the Internet, their friends, their communities, and the world.",
        "score": 0.175289785710158,
        "scaled_score": 0.175289785710158,
        "id": 2453
    },
    {
        "title": "Spellbound",
        "url": "http://Pixton.com/ic:i5xovlrn",
        "content": "Spellbound. Turning screen time into activity time, Spellbound is a cooperatively competitive real-time real world multiplayer mobile game. It uses a fantasy game context to connect and bring people together and encourage new kinds of activities in existing physical spaces, as well as to encourage collaborative and strategic thinking.",
        "score": 0.225440680095694,
        "scaled_score": 0.225440680095694,
        "id": 2460
    },
    {
        "title": "Telematic Sculptures (Chit Chat Club II)",
        "url": "http://chitchatclub.org",
        "content": "Telematic Sculptures (Chit Chat Club II). Chit Chat Club is an experiment in bringing people together in both immediate and online spaces. It consists of a set of communication portals in the form of human-scale sculptures; these give the remote user equivalent presence among the co-located participants. Each sculpture features a different interaction style, allowing us to evaluate the social effect of different interfaces.",
        "score": 0.871068218287047,
        "scaled_score": 0.871068218287047,
        "id": 2471
    },
    {
        "title": "Flexor Exercise Sleeve",
        "url": "http://www.media.mit.edu/context/",
        "content": "Flexor Exercise Sleeve. Flexor is an arm sleeve with a bend sensor, an annunciator, and electro-luminescent lights. It keeps track of arm movement and uses models of arm motion to create entertaining and useful feedback for physical therapy or exercise. If you move your arm in natural gestures, the electro-luminescent lights sparkle like sequins with every movement. When you bend your arm for exercise, as in a weight-lifting bicep curl, the sleeve counts repetitions, encouraging body awareness. A variable resistor in the sleeve senses body position, while an on-board microprocessor facilitates interaction through electro-luminescence and sound. Therapy can also be coupled with expression, communication, performance, play, jewelry, and tools. This playful exploration could also be used to teach people how to protect their ligaments and muscles from strain and injury while playing tennis, squash, or golf, or even picking up their small children.",
        "score": 0.218687140939591,
        "scaled_score": 0.218687140939591,
        "id": 2489
    },
    {
        "title": "Coterie",
        "url": "-",
        "content": "Coterie. Coterie is an emerging series of experiments in the dynamic visualizations of online communities. Coterie reintroduces a human element to an abstract data source by creating visual representations that evoke the underlying activity and interactions among the members of an online community. The first experiment in this series portrays individuals as ovals, using a bouncing motion to show current individual activity. A person's saturation and opacity reflect their participation, over time, in the group.",
        "score": 0.13214902999781,
        "scaled_score": 0.13214902999781,
        "id": 2491
    },
    {
        "title": "High-Resolution Interferometric Accelerometer",
        "url": "-",
        "content": "High-Resolution Interferometric Accelerometer. We are developing a new type of microfabricated accelerometer based on the optical interferometer. The interferometer consists of surface-micromachined interdigital fingers that are alternately attached to a proof mass and support substrate. Illuminating the fingers with coherent light generates a series of diffracted optical beams. Sub-angstrom displacements between the proof mass and frame are detected by measuring the intensity of a diffracted beam. The structure is fabricated with a two-mask silicon process and detected with a standard laser diode and photodetector. We estimate that the minimum detectable acceleration is six orders of magnitude below the acceleration of gravity (i.e., 2 ug/rootHz in a 1 Hz bandwidth centered at 650 Hz). Current emphasis is on packaging this device within a volume less than 10 cubic centimeters.",
        "score": 0.939999999994251,
        "scaled_score": 0.939999999994251,
        "id": 2492
    },
    {
        "title": "tailor",
        "url": "http://tailor.media.mit.edu",
        "content": "tailor. In online environments, we often rely on some combination of pictures and pseudonyms to show others what kind of person we are. In more anonymous contexts, we tend to rely on non-representational images while on services like Facebook, identifiable pictures are the norm. In this project, we seek to turn the iconic profile picture into something more active and dynamic. With tailor, you can easily apply dynamic graphical effects and data-driven information to an existing profile picture on Twitter. Tailor will automatically update your profile picture based on these overlays. These overlays might include your current location, number of followers, or visualizations of your favorite team's recent record. Tailor will also support scenarios like automatically updating your picture when you upload pictures to Flickr, visually aging pictures the longer you have them, morphing between different pictures, or programmatically generating interesting abstract profile pictures.",
        "score": 0.391106816192007,
        "scaled_score": 0.391106816192007,
        "id": 2494
    },
    {
        "title": "Danish Rye Bread Elements",
        "url": "http://www.truonex.com/projects/1707",
        "content": "Danish Rye Bread Elements. There were so many questions about the dense Danish rugbrød, so it was time to investigate. Three different loaves of rye bread were dissected by hand and each element was weighed. Asking the baker or perusing recipes would not have given the same results; this analysis gives specific answers based on the particular loaves that were chosen.",
        "score": 0.361426217422861,
        "scaled_score": 0.361426217422861,
        "id": 2499
    },
    {
        "title": "Collecting and filtering PowerPoint slides",
        "url": "http://www.truonex.com/projects/1706",
        "content": "Collecting and filtering PowerPoint slides. An experiment in collecting and filtering Microsoft PowerPoint slides.",
        "score": 0.0100000000000007,
        "scaled_score": 0.0100000000000007,
        "id": 2500
    },
    {
        "title": "Blood Sugar Visualization",
        "url": "http://www.truonex.com/projects/1705",
        "content": "Blood Sugar Visualization. This is an interactive visualization of blood glucose data. Data is gathered as a comma separated file (csv) through the Glooko cord or ibgStar blood sugar meter.",
        "score": 0.0100000000003764,
        "scaled_score": 0.0100000000003764,
        "id": 2501
    },
    {
        "title": "Topes",
        "url": "http://www.truonex.com/projects/2345",
        "content": "Topes. Topes is a new user-extensible model for semi-structured data items. Each tope defines how to recognize a kind of data item based on format and context, and how to transform that kind of item among valid formats. To show the usefulness of this model, we will provide an environment to help end-user programmers to create, share, and apply topes, enabling these users to quickly implement data validation and reformatting functionality.",
        "score": 0.361334850212465,
        "scaled_score": 0.361334850212465,
        "id": 2512
    },
    {
        "title": "NRC: Storm Central & Real Time Weather Station",
        "url": "http://www.truonex.com/projects/2380",
        "content": "NRC: Storm Central & Real Time Weather Station. The Storm Central desk features three stations at which visitors can track a hurricane or make their own weather forecast. Each day live weather data is displayed along with helpful tips from WRAL meteorologist Greg Fishel. Visitors use this information to enter what they think the weather will be like the next day. Upon completing a forecast, visitors can then compare their forecast to WRAL’s.",
        "score": 0.558405418930039,
        "scaled_score": 0.558405418930039,
        "id": 2525
    },
    {
        "title": "Sphere: A Multi-Touch Interactive Spherical Display",
        "url": "http://www.truonex.com/projects/2144",
        "content": "Sphere: A Multi-Touch Interactive Spherical Display. Our prototype device builds on a commercially available globe projection system (Global Imagination�s Magic Planet). We have added touch-sensing capabilities with an infrared camera that shares the optical path with the projector. This novel configuration permits us to enclose both the projection and the sensing mechanism in the base of the device and allows for easy 360 degrees access to the device and high degree of interactivity without shadowing or occlusion problems. We have also developed",
        "score": 0.245136070682813,
        "scaled_score": 0.245136070682813,
        "id": 2531
    },
    {
        "title": "Affective Carpet",
        "url": "http://www.media.mit.edu/affect/AC_research/projects/affective_carpet.html",
        "content": "Affective Carpet. The \"Affective Carpet\" is a soft, deformable surface made of cloth and foam, which detects continuous pressure with excellent sensitivity and resolution. It is being used as an interface for projects in affective expression, including as a controller to measure a musical performer's direction and intensity in leaning and weight-shifting patterns.",
        "score": 0.428981635435743,
        "scaled_score": 0.428981635435743,
        "id": 2538
    },
    {
        "title": "Interface Tailor",
        "url": "-",
        "content": "Interface Tailor. The Interface Tailor is an agent that attempts to adapt a system in response to affective feedback. Frustration is being used as a fitness function to select between a wide variety of different system behaviors. Currently, the Microsoft Office Assistant (or Paperclip) is one example interface that is being made more adaptive. Ultimately the project seeks to provide a generalized framework for making all software more tailor-able.",
        "score": 0.217025840333616,
        "scaled_score": 0.217025840333616,
        "id": 2545
    },
    {
        "title": "Hear&There",
        "url": "http://smg.media.mit.edu/projects/HearAndThere/",
        "content": "Hear&There. Hear&There is an augmented reality system using audio as the primary interface. Using the authoring component of this system, individuals can leave \"audio imprints,\" consisting of several layers of music, sound effects, or recorded voice, at a location outdoors. Using the navigation component, individuals can hear imprints by walking into the area that the imprint occupies. Furthermore, imprints can be linked together, whereby an individual is directed from one imprint to related imprints in the area.",
        "score": 0.19867710346188,
        "scaled_score": 0.19867710346188,
        "id": 2547
    },
    {
        "title": "Monocoque",
        "url": "-",
        "content": "Monocoque. French for \"single shell,\" Monocoque stands for a construction technique that supports structural load using an object's external skin. Contrary to the traditional design of building skins that distinguish between internal structural frameworks and non-bearing skin elements, this approach promotes heterogeneity and differentiation of material properties. The project demonstrates the notion of a structural skin using a Voronoi pattern, the density of which corresponds to multi-scalar loading conditions. The distribution of shear-stress lines and surface pressure is embodied in the allocation and relative thickness of the vein-like elements built into the skin. Its innovative 3D printing technology provides for the ability to print parts and assemblies made of multiple materials within a single build, as well as to create composite materials that present preset combinations of mechanical properties.",
        "score": 0.184997153265252,
        "scaled_score": 0.184997153265252,
        "id": 2548
    }
]